[
    {
        "id" : 1,
        "bookInfo": {
            "title": "The Girl with the Dragon Tattoo",
            "author": "Stieg Larsson",
            "pages": 672,
            "description": "A gripping mystery that follows journalist Mikael Blomkvist and hacker Lisbeth Salander as they investigate a wealthy family's dark secrets on a remote island. The plot weaves financial intrigue, family drama, and a cold case into a thrilling narrative. As they delve deeper, they uncover shocking truths that intertwine with Salander's troubled past. Larsson's compelling storytelling and complex characters make this novel a compelling and intense read.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1684638853i/2429135.jpg",
            "lang": "Swedish, English",
            "publisher": "Vintage Crime, Black Lizard",
            "publishedDate": "September 16, 2008",
            "category": 1
        }
    },
    {
        "id" : 2,
        "bookInfo": {
            "title": "Gone Girl",
            "author": "Gillian Flynn",
            "pages": 432,
            "description": "On a seemingly ordinary day, Nick and Amy Dunne's marriage takes a dark turn when Amy goes missing. As the media frenzy and police investigation unfold, secrets are exposed, and the truth becomes elusive. Flynn's psychological thriller keeps readers on the edge, exploring the complexities of relationships and the media's impact on public perception. With unexpected twists and turns, 'Gone Girl' is a gripping exploration of deception and the consequences of a troubled marriage.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1554086139i/19288043.jpg",
            "lang": "English",
            "publisher": "Crown Publishing Group",
            "publishedDate": "June 5, 2012",
            "category": 1
        }
    },
    {
        "id" : 3,
        "bookInfo": {
            "title": "The Da Vinci Code",
            "author": "Dan Brown",
            "pages": 593,
            "description": "Harvard symbolist Robert Langdon is drawn into a complex web of secrets and conspiracies when he is called to the Louvre to unravel the mystery behind a curator's murder. As Langdon and cryptologist Sophie Neveu follow cryptic clues, they discover a trail that leads to hidden truths about religious history. Brown's fast-paced thriller combines art, history, and code-breaking, creating a suspenseful journey that challenges established beliefs.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1176671419i/643301.jpg",
            "lang": "English",
            "publisher": "Doubleday",
            "publishedDate": "March 18, 2003",
            "category": 1
        }
    },
    {
        "id" : 4,
        "bookInfo": {
            "title": "The Silence of the Lambs",
            "author": "Thomas Harris",
            "pages": 338,
            "description": "FBI trainee Clarice Starling seeks the help of imprisoned psychiatrist Dr. Hannibal Lecter to catch a serial killer known as Buffalo Bill. As Lecter and Starling engage in a psychological dance, the investigation becomes a chilling journey into the darkest corners of the human mind. Harris crafts a suspenseful and psychologically intense narrative, making 'The Silence of the Lambs' a classic in the thriller genre.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1647930822i/23807.jpg",
            "lang": "English",
            "publisher": "t. Martin's Press",
            "publishedDate": "May 1, 1988",
            "category": 1
        }
    },
    {
        "id" : 5,
        "bookInfo": {
            "title": "The Big Sleep",
            "author": "Raymond Chandler",
            "pages": 231,
            "description": "Private detective Philip Marlowe is hired by a wealthy General Sternwood to investigate the gambling debts of his two daughters. As Marlowe delves into the murky world of Los Angeles' elite, he encounters corruption, deception, and murder. Chandler's writing, characterized by its gritty realism and sharp dialogue, makes 'The Big Sleep' a classic in the noir genre, setting the standard for hardboiled detective fiction.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1371584712i/2052.jpg",
            "lang": "English",
            "publisher": "Alfred A. Knopf",
            "publishedDate": "February 6, 1939",
            "category": 1
        }
    },
    {
        "id" : 6,
        "bookInfo": {
            "title": "In the Woods",
            "author": "Tana French",
            "pages": 429,
            "description": "Detective Rob Ryan and his partner Cassie Maddox investigate the murder of a young girl in a small Irish town, a crime with chilling similarities to a traumatic event from Ryan's own childhood. As they delve into the case, long-buried secrets resurface, complicating both the investigation and Ryan's personal life. Tana French weaves a psychological and atmospheric mystery, keeping readers on edge until the very end.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1562761513i/2459785.jpg",
            "lang": "English",
            "publisher": "Viking Penguin",
            "publishedDate": "May 17, 2007",
            "category": 1
        }
    },
    {
        "id" : 7,
        "bookInfo": {
            "title": "The Hound of the Baskervilles",
            "author": "Sir Arthur Conan Doyle",
            "pages": 256,
            "description": "Sherlock Holmes and Dr. John Watson investigate the mysterious death of Sir Charles Baskerville, whose demise on the moors is believed to be linked to a family curse involving a supernatural hound. Set in the atmospheric moors of Devonshire, Conan Doyle's classic mystery combines elements of suspense, detective work, and the supernatural. 'The Hound of the Baskervilles' remains one of the most famous and enduring works in the Sherlock Holmes canon.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1355929358i/8921.jpg",
            "lang": "English",
            "publisher": "George Newnes Ltd.",
            "publishedDate": "April 1902",
            "category": 1
        }
    },
    {
        "id" : 8,
        "bookInfo": {
            "title": "Before I Go to Sleep",
            "author": "S.J. Watson",
            "pages": 368,
            "description": "Christine Lucas, the protagonist, wakes up every day with no memory of her past due to a rare form of amnesia. Through a journal provided by her husband and a neuropsychologist, she attempts to piece together the events leading to her memory loss. As Christine unravels the mysteries of her life, she discovers shocking truths that challenge her understanding of reality. 'Before I Go to Sleep' is a gripping and suspenseful exploration of memory, trust, and identity.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1358353512i/9736930.jpg",
            "lang": "English",
            "publisher": "HarperCollins",
            "publishedDate": "June 14, 2011",
            "category": 1
        }
    },
    {
        "id" : 9,
        "bookInfo": {
            "title": "Mystic River",
            "author": "Dennis Lehane",
            "pages": 528,
            "description": "In 'Mystic River', childhood friends Jimmy, Sean, and Dave are brought back together by a tragedy that reopens wounds from their past. When Jimmy's daughter is murdered, Sean, now a detective, investigates the crime, uncovering dark secrets and testing the bonds of friendship. Lehane's novel delves into themes of loss, justice, and the impact of the past on the present, creating a compelling and emotionally charged narrative.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1407109549i/21671.jpg",
            "lang": "English",
            "publisher": "William Morrow",
            "publishedDate": "April 22, 2001",
            "category": 1
        }
    },
    {
        "id" : 10,
        "bookInfo": {
            "title": "The No. 1 Ladies' Detective Agency",
            "author": "Alexander McCall Smith",
            "pages": 235,
            "description": "Set in Botswana, 'The No. 1 Ladies' Detective Agency' introduces readers to Precious Ramotswe, a traditionally built woman who starts the first female detective agency in the country. With a keen sense of intuition and a no-nonsense attitude, Precious takes on cases, solving mysteries and helping her clients in unexpected ways. McCall Smith's novel is a delightful blend of mystery, humor, and insights into the culture of Botswana.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1459953654i/7061.jpg",
            "lang": "English",
            "publisher": "Polygon Books",
            "publishedDate": "March 27, 1998",
            "category": 1
        }
    },
    {
        "id" : 11,
        "bookInfo": {
            "title": "The Bourne Identity",
            "author": "Robert Ludlum",
            "pages": 523,
            "description": "Jason Bourne is discovered floating in the Mediterranean Sea with amnesia and mysterious bullet wounds. As he tries to piece together his identity, he realizes he possesses extraordinary skills and is being pursued by deadly assassins. Ludlum's gripping thriller takes readers on a high-stakes journey filled with espionage, conspiracy, and intense action, establishing 'The Bourne Identity' as a classic in the spy fiction genre.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1335860740i/7869.jpg",
            "lang": "English",
            "publisher": "Richard Marek Publishers",
            "publishedDate": "February 4, 1980",
            "category": 1
        }
    },
    {
        "id" : 12,
        "bookInfo": {
            "title": "The Secret History",
            "author": "Donna Tartt",
            "pages": 559,
            "description": "Richard Papen, a student at a small Vermont college, becomes entangled with an elite group of students led by their charismatic and mysterious professor. As the group delves into the study of classical Greek, the boundaries between friendship, obsession, and tragedy blur. Tartt's debut novel is a psychological and atmospheric exploration of morality, guilt, and the consequences of intellectual pursuits, making 'The Secret History' a compelling and thought-provoking read.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1451554846i/29044.jpg",
            "lang": "English",
            "publisher": "Alfred A. Knopf",
            "publishedDate": "September 6, 1992",
            "category": 1
        }
    },
    {
        "id" : 13,
        "bookInfo": {
            "title": "The Maltese Falcon",
            "author": "Dashiell Hammett",
            "pages": 213,
            "description": "Private detective Sam Spade becomes entangled in a web of deceit and murder when a mysterious woman seeks his help in finding her sister and a valuable statuette, the Maltese Falcon. As Spade navigates the treacherous world of criminals and double-crosses, he must unravel the truth behind the falcon's significance. Hammett's novel is a classic example of hardboiled detective fiction, featuring sharp dialogue and a labyrinthine plot.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1689040081i/29999.jpg",
            "lang": "English",
            "publisher": "Alfred A. Knopf",
            "publishedDate": "February 14, 1930",
            "category": 1
        }
    },
    {
        "id" : 14,
        "bookInfo": {
            "title": "The Silent Patient",
            "author": "Alex Michaelides",
            "pages": 336,
            "description": "Alicia Berenson, a celebrated painter, shoots her husband and then stops speaking. She becomes a patient in a secure forensic unit, and her silence becomes the center of intrigue for both the public and her therapist. The story unfolds as the therapist tries to unravel the mystery behind Alicia's silence and the events leading up to the shooting. Michaelides crafts a suspenseful psychological thriller with unexpected twists, making 'The Silent Patient' a gripping and intriguing read.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1668782119i/40097951.jpg",
            "lang": "English",
            "publisher": "Celadon Books",
            "publishedDate": "February 5, 2019",
            "category": 1
        }
    },
    {
        "id" : 15,
        "bookInfo": {
            "title": "Dark Places",
            "author": "Gillian Flynn",
            "pages": 349,
            "description": "Libby Day, the sole survivor of her family's massacre, is forced to confront her past when a club of amateur investigators questions the guilt of her imprisoned brother. As Libby reexamines the events leading to her family's tragedy, she discovers dark secrets and hidden truths. Flynn weaves a suspenseful narrative in 'Dark Places', exploring themes of trauma, family dynamics, and the impact of the past on the present.",
            "genres": "Mystery/Thriller",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1354988288i/5886881.jpg",
            "lang": "English",
            "publisher": "Shaye Areheart Books",
            "publishedDate": "May 5, 2009",
            "category": 1
        }
    },
    {
        "id" : 16,
        "bookInfo": {
            "title": "Dune",
            "author": "Frank Herbert",
            "pages": 694,
            "description": "'Dune' is a science fiction epic set in the distant future where noble families control planets, and a desert planet named Arrakis is the only source of a valuable spice called melange. The story follows young Paul Atreides, whose family takes control of Arrakis, leading to political intrigue, rebellion, and Paul's own journey toward destiny. Frank Herbert's 'Dune' is a complex and richly detailed novel that explores themes of politics, religion, and environmentalism.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1555447414i/44767458.jpg",
            "lang": "English",
            "publisher": "Chilton Books",
            "publishedDate": "August 1, 1965",
            "category": 2
        }
    },
    {
        "id" : 17,
        "bookInfo": {
            "title": "The Left Hand of Darkness",
            "author": "Ursula K. Le Guin",
            "pages": 304,
            "description": "'The Left Hand of Darkness' is part of Ursula K. Le Guin's Hainish Cycle series. It follows the story of Genly Ai, an ambassador from a federation of planets, as he navigates the political and social complexities of the planet Gethen. The inhabitants of Gethen are ambisexual, with no fixed gender, adding a unique dimension to the exploration of identity and relationships. Le Guin's novel is celebrated for its exploration of sociopolitical themes and its impact on the science fiction genre.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1488213612i/18423.jpg",
            "lang": "English",
            "publisher": "Ace Books",
            "publishedDate": "June 1969",
            "category": 2
        }
    },
    {
        "id" : 18,
        "bookInfo": {
            "title": "Snow Crash",
            "author": "Neal Stephenson",
            "pages": 480,
            "description": "'Snow Crash' is a cyberpunk novel set in a near-future America where the virtual world and the real world are interconnected. The story follows Hiro Protagonist, a hacker and pizza delivery driver, as he discovers a new drug called Snow Crash that has the potential to affect both the virtual and physical realms. Stephenson's novel explores themes of technology, linguistics, and the consequences of a hyper-connected society.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1589842551i/40651883.jpg",
            "lang": "English",
            "publisher": "Bantam Books",
            "publishedDate": "June 1992",
            "category": 2
        }
    },
    {
        "id" : 19,
        "bookInfo": {
            "title": "The Hitchhiker's Guide to the Galaxy",
            "author": "Douglas Adams",
            "pages": 208,
            "description": "'The Hitchhiker's Guide to the Galaxy' follows the misadventures of Arthur Dent, an unwitting Earthman, as he embarks on a journey through space with Ford Prefect, an alien researcher for the titular guide. Full of absurdity, humor, and wit, Adams' novel satirizes science fiction conventions while exploring philosophical questions about life, the universe, and everything.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1531891848i/11.jpg",
            "lang": "English",
            "publisher": "Pan Books",
            "publishedDate": "October 12, 1979",
            "category": 2
        }
    },
    {
        "id" : 20,
        "bookInfo": {
            "title": "Starship Troopers",
            "author": "Robert A. Heinlein",
            "pages": 263,
            "description": "Starship Troopers is a military science fiction novel that follows the protagonist, Juan Johnnie Rico, as he enlists in the Mobile Infantry to fight in an interstellar war against an insectoid species known as the Bugs. Heinlein's novel explores themes of citizenship, duty, and the role of the military in society, blending action with philosophical discussions about the responsibilities of individuals and the state.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1614054412i/17214.jpg",
            "lang": "English",
            "publisher": "G.P. Putnam's Sons",
            "publishedDate": "October 1959",
            "category": 2
        }
    },
    {
        "id" : 21,
        "bookInfo": {
            "title": "Neuromancer",
            "author": "William Gibson",
            "pages": 271,
            "description": "Neuromancer is a groundbreaking cyberpunk novel that follows Case, a washed-up computer hacker, as he is hired by a mysterious employer for a final job. Set in a dystopian future where technology and virtual reality merge, the story explores themes of artificial intelligence, corporate power, and the impact of technology on society. William Gibson's novel is known for its influential role in shaping the cyberpunk subgenre.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1554437249i/6088007.jpg",
            "lang": "English",
            "publisher": "Ace Books",
            "publishedDate": "July 1984",
            "category": 2
        }
    },
    {
        "id" : 22,
        "bookInfo": {
            "title": "The Name of the Wind",
            "author": "Patrick Rothfuss",
            "pages": 662,
            "description": "The Name of the Wind is the first book in the Kingkiller Chronicle series. It follows the protagonist, Kvothe, as he recounts his life's journey from a gifted child in a traveling troupe to a student at the prestigious University. The narrative weaves magic, music, and mystery, as Kvothe seeks knowledge, confronts challenges, and strives to uncover the truth behind his troubled past.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1270352123i/186074.jpg",
            "lang": "English",
            "publisher": "DAW Books",
            "publishedDate": "March 27, 2007",
            "category": 2
        }
    },
    {
        "id" : 23,
        "bookInfo": {
            "title": "Ender's Game",
            "author": "Orson Scott Card",
            "pages": 324,
            "description": "Ender's Game is a classic science fiction novel that follows the story of Andrew Ender Wiggin, a young boy recruited into a highly competitive military training program to prepare for an impending alien invasion. Ender exhibits exceptional strategic and tactical skills, making him a key player in humanity's defense. Orson Scott Card's novel explores themes of leadership, empathy, and the consequences of war.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1408303130i/375802.jpg",
            "lang": "English",
            "publisher": "Tor Books",
            "publishedDate": "January 1985",
            "category": 2
        }
    },
    {
        "id" : 24,
        "bookInfo": {
            "title": "The Three-Body Problem",
            "author": "Liu Cixin",
            "pages": 416,
            "description": "The Three-Body Problem is the first book in the Remembrance of Earth's Past trilogy. Set against the backdrop of China's Cultural Revolution and later in the present day, the novel explores the consequences of humanity's first contact with an alien civilization. Liu Cixin's work combines hard science fiction with philosophical and cultural elements, creating a complex and thought-provoking narrative.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1415428227i/20518872.jpg",
            "lang": "English",
            "publisher": "Tor Books",
            "publishedDate": "November 11, 2014",
            "category": 2
        }
    },
    {
        "id" : 25,
        "bookInfo": {
            "title": "The Fifth Season",
            "author": "N.K. Jemisin",
            "pages": 468,
            "description": "The Fifth Season is the first book in the Broken Earth trilogy. In a world constantly on the brink of catastrophic geological events, individuals with the power to control and manipulate the earth are both feared and oppressed. The story follows three women at different times in their lives as they navigate a world on the brink of destruction. N.K. Jemisin's novel explores themes of power, oppression, and resilience in a unique and immersive fantasy setting.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1386803701i/19161852.jpg",
            "lang": "English",
            "publisher": "Orbit",
            "publishedDate": "August 4, 2015",
            "category": 2
        }
    },
    {
        "id" : 26,
        "bookInfo": {
            "title": "Hyperion",
            "author": "Dan Simmons",
            "pages": 482,
            "description": "Hyperion is the first book in the Hyperion Cantos series. It presents a frame narrative structure, where seven pilgrims tell their stories during a journey to the distant world of Hyperion. Each pilgrim's tale unfolds as they reveal their connection to the mysterious and powerful Shrike. Dan Simmons weaves a complex and richly detailed narrative that combines elements of science fiction, mythology, and philosophy.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1405546838i/77566.jpg",
            "lang": "English",
            "publisher": "Doubleday",
            "publishedDate": "February 1989",
            "category": 2
        }
    },
    {
        "id" : 27,
        "bookInfo": {
            "title": "A Fire Upon the Deep",
            "author": "Vernor Vinge",
            "pages": 613,
            "description": "A Fire Upon the Deep is a space opera that explores a universe where the laws of physics vary across different regions. When an ancient evil is unleashed in the High Beyond, a human research team unwittingly becomes entangled in a galactic struggle for survival. Vernor Vinge's novel combines epic space adventure with themes of artificial intelligence, interstellar politics, and the consequences of advanced technology.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1333915005i/77711.jpg",
            "lang": "English",
            "publisher": "Tor Books",
            "publishedDate": "January 15, 1992",
            "category": 2
        }
    },
    {
        "id" : 28,
        "bookInfo": {
            "title": "Red Mars",
            "author": "Kim Stanley Robinson",
            "pages": 572,
            "description": "Red Mars is the first book in the Mars Trilogy. The novel explores the colonization and terraforming of Mars by a diverse group of scientists and engineers. As tensions rise among the colonists and Earth, political and environmental challenges shape the destiny of the Red Planet. Kim Stanley Robinson's work delves into the scientific, social, and political implications of human settlement on Mars.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660272828i/77507.jpg",
            "lang": "English",
            "publisher": "Bantam Spectra",
            "publishedDate": "November 1, 1992",
            "category": 2
        }
    },
    {
        "id" : 29,
        "bookInfo": {
            "title": "The Lies of Locke Lamora",
            "author": "Scott Lynch",
            "pages": 722,
            "description": "The Lies of Locke Lamora is the first book in the Gentleman Bastard series. The story follows a group of skilled con artists led by the charismatic and cunning Locke Lamora. Set in the sprawling city of Camorr, the novel combines intricate heists, political intrigue, and a richly detailed world. Scott Lynch's work is known for its clever plotting, engaging characters, and a blend of humor and suspense.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1458646334i/29588376.jpg",
            "lang": "English",
            "publisher": "Bantam Spectra",
            "publishedDate": "June 27, 2006",
            "category": 2
        }
    },
    {
        "id" : 30,
        "bookInfo": {
            "title": "The Blade Itself",
            "author": "Joe Abercrombie",
            "pages": 515,
            "description": "The Blade Itself is the first book in the The First Law trilogy. The story follows several characters, including Logen Ninefingers, Inquisitor Glokta, and Captain Jezal dan Luthar, as their lives become entwined in a world of political intrigue, war, and magic. Joe Abercrombie's novel is known for its gritty realism, complex characters, and a narrative that challenges traditional fantasy tropes.",
            "genres": "Science Fiction",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1284167912l/944073.jpg",
            "lang": "English",
            "publisher": "Gollancz",
            "publishedDate": "September 4, 2006",
            "category": 2
        }
    },
    {
        "id" : 31,
        "bookInfo": {
            "title": "Pride and Prejudice ",
            "author": "Jane Austen",
            "pages": 488,
            "description": "Pride and Prejudice is a classic novel that tells the story of Elizabeth Bennet, a young woman who faces the challenges of society, family, and love in the early 19th century England. She meets Mr. Darcy, wealthy and proud gentleman, who initially dislikes her for her lively and independent spirit. However, as they encounter each other more often, they gradually overcone their pride and prejudice and develop a mutual respect and affection. The novel is famous for its witty and ironic style, its realistic portrayal of manners and morals, and its memorable characters and themes.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1320399351i/1885.jpg",
            "lang": "English",
            "publisher": "T. Egerton.",
            "publishedDate": "January 28, 1813",
            "category": 3
        }
    },
    {
        "id" : 32,
        "bookInfo": {
            "title": "Me Before You",
            "author": "Jojo Moyes",
            "pages": 369,
            "description": "The book is a romance novel that follows the story of Louisa Clark, a young woman who becomes a caregiver for Will Traynor, a wealthy man who is paralyzed after an accident. Louise tries tis show will that life is still worth living, despite his plans to end his life through assisted suletide. The book explores the themes of love, choler, disability, and euthanasia. The book is part of a trilogy that also includes 'after You' and 'STIII Ma', which foll Louisa's journey after Will's death.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1665087720i/17347634.jpg",
            "lang": "English",
            "publisher": "Penguin Group ",
            "publishedDate": "July 30, 2013",
            "category": 3
        }
    },
    {
        "id" : 33,
        "bookInfo": {
            "title": "The Notebook",
            "author": "Nicholas Sparks",
            "pages": 272,
            "description": "'The Notebook' by Nicholas Sparks is a captivating love story that follows the journey of Noah and Allie. Set in the 1940s, their passionate summer romance is abruptly cut short due to societal expectations. Years later, fate brings them together again, testing their love and commitment. This heartwarming tale explores the power of true love and the enduring bond between two souls destined to be together.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1483183484i/33648131.jpg",
            "lang": "English",
            "publisher": "Warner Books",
            "publishedDate": "October 1, 1996",
            "category": 3
        }
    },
    {
        "id" : 34,
        "bookInfo": {
            "title": "Sense and Sensibility",
            "author": "Jane Austen",
            "pages": 384,
            "description": "'Sense and Sensibility' is a classic novel by Jane Austen that explores the lives of the Dashwood sisters, Elinor and Marianne. Set in 19th-century England, the story delves into their romantic pursuits, challenges, and societal expectations. Elinor embodies sense and rationality, while Marianne represents sensibility and passion. This timeless tale beautifully captures the complexities of love, family, and societal norms.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1397245675i/14935.jpg",
            "lang": "English",
            "publisher": "Thomas Egerton",
            "publishedDate": "October 30, 1811",
            "category": 3
        }
    },
    {
        "id" : 35,
        "bookInfo": {
            "title": "The Fault in Our Stars",
            "author": "John Green",
            "pages": 313,
            "description": "'The Fault in Our Stars' is a heart-wrenching young adult novel that tells the story of Hazel and Gus, two teenagers who meet and fall in love at a cancer support group. As they navigate the challenges of their illnesses, they embark on a journey of love, hope, and the pursuit of a meaningful life. This emotionally powerful story explores themes of love, loss, and the beauty of fleeting moments.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660273739i/11870085.jpg",
            "lang": "English",
            "publisher": "Dutton Books",
            "publishedDate": "January 10, 2012",
            "category": 3
        }
    },
    {
        "id" : 36,
        "bookInfo": {
            "title": "Wuthering Heights:",
            "author": "Emily Brontë",
            "pages": 464,
            "description": "'Wuthering Heights' is a captivating novel that explores the intense and tumultuous love story between Catherine Earnshaw and Heathcliff. Set against the backdrop of the Yorkshire moors, this gothic tale delves into themes of passion, revenge, and the destructive power of love. Brontë's vivid writing brings to life the haunting atmosphere and complex characters that make this novel a timeless classic.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1693360409i/198219479.jpg",
            "lang": "English",
            "publisher": "Thomas Cautley Newby",
            "publishedDate": "December 1847",
            "category": 3
        }
    },
    {
        "id" : 37,
        "bookInfo": {
            "title": "Jane Eyre",
            "author": "Charlotte Brontë",
            "pages": 532,
            "description": "'Jane Eyre' follows the life of the titular character, Jane Eyre, as she navigates through a challenging and often unjust world. From her difficult childhood to her time as a governess at Thornfield Hall, Jane's journey is filled with love, secrets, and self-discovery. This classic novel explores themes of independence, morality, and the search for belonging.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1692725440i/197321006.jpg",
            "lang": "English",
            "publisher": "Smith, Elder & Co.",
            "publishedDate": "October 16, 1847",
            "category": 3
        }
    },
    {
        "id" : 38,
        "bookInfo": {
            "title": "A Walk To Remember",
            "author": "Nicholas Sparks",
            "pages": 240,
            "description": "'A Walk to Remember' is a heartwarming and bittersweet love story between Landon Carter and Jamie Sullivan. Set in the small town of Beaufort, North Carolina, the book explores themes of love, faith, and the power of redemption. It beautifully captures the journey of two individuals from different worlds who find solace and inspiration in each other's presence.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1560242520i/42283852.jpg",
            "lang": "English",
            "publisher": "Warner Books",
            "publishedDate": "October 1, 1999",
            "category": 3
        }
    },
    {
        "id" : 39,
        "bookInfo": {
            "title": "Crazy Rich Asians",
            "author": "Kevin Kwan",
            "pages": 544,
            "description": "'Crazy Rich Asians' is a hilarious and captivating novel that takes you into the extravagant world of the ultra-wealthy in Singapore. The story follows Rachel Chu, an American-born Chinese woman, as she accompanies her boyfriend Nick Young to his best friend's wedding. Rachel soon discovers that Nick's family is incredibly wealthy and finds herself navigating the complexities of high society, family expectations, and old money traditions.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1364852559i/16085481.jpg",
            "lang": "English",
            "publisher": "Doubleday",
            "publishedDate": "June 11, 2013",
            "category": 3
        }
    },
    {
        "id" : 40,
        "bookInfo": {
            "title": "PS, I Love You",
            "author": "Cecelia Ahern",
            "pages": 512,
            "description": "'PS I Love You' tells the heartfelt story of Holly Kennedy, a young widow who receives a series of letters from her late husband, Gerry. These letters, written before his death, guide Holly on a journey of healing and self-discovery. Through the letters, Gerry helps Holly navigate her grief and encourages her to embrace new experiences, ultimately leading her to find hope, love, and a new sense of purpose.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1392344536i/366522.jpg",
            "lang": "English",
            "publisher": "HarperCollins",
            "publishedDate": "September 1, 2003",
            "category": 3
        }
    },
    {
        "id" : 41,
        "bookInfo": {
            "title": "Anna and The French Kiss",
            "author": "Stephanie Perkins",
            "pages": 400,
            "description": "'Anna and the French Kiss' follows the story of Anna Oliphant, a high school student who is sent to a boarding school in Paris. There, she navigates new friendships, cultural differences, and the excitement of falling in love with Étienne St. Clair, a charming and complicated boy. This heartwarming and romantic novel takes you on a journey of self-discovery and the magic of first love in the enchanting backdrop of Paris.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1694885872i/152135412.jpg",
            "lang": "English",
            "publisher": "Dutton Juvenile",
            "publishedDate": "December 2, 2010",
            "category": 3
        }
    },
    {
        "id" : 42,
        "bookInfo": {
            "title": "The Hating Game",
            "author": "Sally Thorne",
            "pages": 384,
            "description": "'The Hating Game' is a witty and addictive romantic comedy that follows Lucy Hutton and Joshua Templeman, two coworkers who can't stand each other. As executive assistants to co-CEOs of a publishing company, they engage in a fierce rivalry. However, when a promotion is on the line, their relationship takes a surprising turn. This enemies-to-lovers story is filled with banter, chemistry, and unexpected twists that will keep you hooked until the very end.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1481566824i/27213238.jpg",
            "lang": "English",
            "publisher": "William Morrow Paperbacks",
            "publishedDate": "August 9, 2016",
            "category": 3
        }
    },
    {
        "id" : 43,
        "bookInfo": {
            "title": "Pride, Prejudice, and Other Flavors",
            "author": "Sonali Dev",
            "pages": 496,
            "description": "'Pride, Prejudice, and Other Flavors' is a modern retelling of Jane Austen's classic novel 'Pride and Prejudice'. Set in contemporary San Francisco, it follows the story of Dr. Trisha Raje, a talented neurosurgeon from an immigrant Indian family, and DJ Caine, a renowned chef from a wealthy British family. As they navigate their complex family dynamics and societal expectations, they find themselves drawn to each other despite their initial prejudices. This heartfelt and captivating novel explores themes of family, identity, and love in a fresh and engaging way.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1539890985i/41154302.jpg",
            "lang": "English",
            "publisher": "William Morrow Paperbacks",
            "publishedDate": "May 7, 2019",
            "category": 3
        }
    },
    {
        "id" : 44,
        "bookInfo": {
            "title": "Red, White & Royal Blue",
            "author": "Casey McQuiston",
            "pages": 432,
            "description": "'Red, White & Royal Blue' is a delightful and heartwarming LGBTQ+ romance novel. It tells the story of Alex Claremont-Diaz, the First Son of the United States, and Prince Henry, the charming Prince of Wales. When an altercation at a royal wedding threatens diplomatic relations, Alex and Henry are forced to pretend to be best friends. As they spend more time together, their fake friendship turns into a genuine connection, and they must navigate the complexities of their positions and their growing feelings for each other. This book is filled with humor, swoon-worthy moments, and important themes of love, identity, and acceptance.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1566742512i/41150487.jpg",
            "lang": "English",
            "publisher": "St. Martin's Griffin",
            "publishedDate": "May 14, 2019",
            "category": 3
        }
    },
    {
        "id" : 45,
        "bookInfo": {
            "title": "Meant to Be",
            "author": "Lauren Morrill",
            "pages": 292,
            "description": "'Meant to Be' is a charming and romantic young adult novel. It follows the story of Julia, a rule-following bookworm, who finds herself paired up with Jason, a laid-back class clown, on a school trip to London. As they navigate the city's iconic landmarks and unexpected adventures, Julia begins to question her beliefs about love and whether there's such a thing as being 'meant to be'. This book is filled with humor, self-discovery, and a touch of British charm.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1690634330i/195303775.jpg",
            "lang": "English",
            "publisher": "Delacorte Press",
            "publishedDate": "November 13, 2012",
            "category": 3
        }
    },
    {
        "id" : 46,
        "bookInfo": {
            "title": "The Song of Achilles",
            "author": "Madeline Miller",
            "pages": 384,
            "description": "'The Song of Achilles' is a beautifully written historical fiction novel that retells the story of Achilles, the Greek hero of the Trojan War, from the perspective of his companion and lover, Patroclus. It explores their deep bond, the challenges they face, and the impact of their relationship on the events of the war. This book is a blend of mythology, romance, and adventure that will keep you engaged from start to finish.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1357177533i/13623848.jpg",
            "lang": "English",
            "publisher": "Bloomsbury Publishing",
            "publishedDate": "September 20, 2011",
            "category": 3
        }
    },
    {
        "id" : 47,
        "bookInfo": {
            "title": "Call Me by Your Name",
            "author": "André Aciman",
            "pages": 256,
            "description": "'Call Me by Your Name' is a poignant coming-of-age story set in Italy. It follows the summer romance between Elio, a 17-year-old boy, and Oliver, a 24-year-old graduate student who comes to stay with Elio's family. The book explores themes of desire, love, and self-discovery as the two characters navigate their feelings for each other. It's a tender and evocative tale that will capture your heart.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1519203520i/36336078.jpg",
            "lang": "English",
            "publisher": "Farrar, Straus and Giroux",
            "publishedDate": "January 23, 2007",
            "category": 3
        }
    },
    {
        "id" : 48,
        "bookInfo": {
            "title": "The Princess Diaries",
            "author": "Meg Cabot",
            "pages": 256,
            "description": "'The Princess Diaries' follows the story of Mia Thermopolis, an ordinary teenager who discovers that she is the heir to the throne of Genovia. As she navigates her new royal responsibilities, Mia also deals with the ups and downs of high school life and her crush on her best friend's brother.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1355011082i/38980.jpg",
            "lang": "English",
            "publisher": "HarperCollins",
            "publishedDate": "October 16, 2000",
            "category": 3
        }
    },
    {
        "id" : 49,
        "bookInfo": {
            "title": "To All the Boys I've Loved Before",
            "author": "Jenny Han",
            "pages": 355,
            "description": "'To All the Boys I've Loved Before' tells the story of Lara Jean Covey, a high school student who writes secret love letters to all the boys she has ever loved. However, her life takes a turn when the letters are mysteriously sent out, leading to unexpected romantic and personal adventures.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1372086100i/15749186.jpg",
            "lang": "English",
            "publisher": "Simon & Schuster Books for Young Readers",
            "publishedDate": "April 15, 2014",
            "category": 3
        }
    },
    {
        "id" : 50,
        "bookInfo": {
            "title": "Outlander",
            "author": "Diana Gabaldon",
            "pages": 850,
            "description": "'Outlander' is a captivating blend of historical fiction, romance, and time travel. The story follows Claire Randall, a World War II nurse who mysteriously travels back in time to 18th-century Scotland, where she becomes entangled in the Jacobite uprising.",
            "genres": "Romance",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659086907i/10964.jpg",
            "lang": "English",
            "publisher": "Delacorte Press",
            "publishedDate": "June 1,1991",
            "category": 3
        }
    },
    {
        "id" : 51,
        "bookInfo": {
            "title": "The Art of War",
            "author": "Sun Tzu",
            "pages": 80,
            "description": "The Art of War by Sun Tzu is a timeless classic on military strategy. It offers valuable insights on tactics, leadership, and the psychology of warfare. In just five lines, this book teaches you how to outsmart your enemies, seize opportunities, and achieve victory. It's a must-read for anyone interested in strategy and success.",
            "genres": "Philosophy,Military Strategy",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1630683326i/10534.jpg",
            "lang": "English",
            "publisher": "Harper Press",
            "publishedDate": "January 1, 401",
            "category": 4
        }
    },
    {
        "id" : 52,
        "bookInfo": {
            "title": "Meditations",
            "author": "Marcus Aurelius",
            "pages": 63,
            "description": "Meditations is a collection of personal reflections and philosophical musings by the Roman Emperor Marcus Aurelius. In this book, he explores topics such as virtue, self-discipline, and the nature of the universe. It offers timeless wisdom and insights into the Stoic philosophy.",
            "genres": "Philosophy, Self-help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1449583602i/28139847.jpg",
            "lang": "English",
            "publisher": "Wisehouse Classics",
            "publishedDate": "December 7, 2015",
            "category": 4
        }
    },
    {
        "id" : 53,
        "bookInfo": {
            "title": "Beyond Good and Evil",
            "author": "Friedrich Nietzsche",
            "pages": 240,
            "description": "Beyond Good and Evil is a philosophical work by Friedrich Nietzsche that challenges traditional moral concepts and explores the nature of truth, power, and human existence. Nietzsche delves into topics such as the will to power, the critique of morality, and the concept of the Übermensch (Superman)",
            "genres": "Philosophy",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388607391i/12321.jpg",
            "lang": "English",
            "publisher": "Penguin Classics",
            "publishedDate": "April 29, 2003 ",
            "category": 4
        }
    },
    {
        "id" : 54,
        "bookInfo": {
            "title": "The Republic",
            "author": "Plato",
            "pages": 183,
            "description": "The Republic is a philosophical work by Plato that explores the nature of justice, the ideal society, and the role of the philosopher-king. In this dialogue, Socrates engages in discussions with various characters to examine topics such as ethics, politics, and the nature of knowledge.",
            "genres": "Philosophy, Political Philosophy",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1348781109i/556252.jpg",
            "lang": "English",
            "publisher": "Trans-Atlantic Publications, Inc",
            "publishedDate": "April 10, 2007",
            "category": 4
        }
    },
    {
        "id" : 55,
        "bookInfo": {
            "title": "The Prince",
            "author": "Niccolò Machiavelli",
            "pages": 144,
            "description": "The Prince is a political treatise written by Niccolò Machiavelli during the Renaissance period. In this book, Machiavelli offers advice on leadership and governance, discussing topics such as power, politics, and the nature of rulership. It is known for its pragmatic and realistic approach to political affairs.",
            "genres": "Political Science, Philosophy",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1390055828i/28862.jpg",
            "lang": "English",
            "publisher": "Dante University Press",
            "publishedDate": "July 13, 2014",
            "category": 4
        }
    },
    {
        "id" : 56,
        "bookInfo": {
            "title": "Sophie's World",
            "author": "Jostein Gaarder",
            "pages": 518,
            "description": "'Sophie's World' follows the philosophical journey of 14-year-old Sophie Amundsen as she is introduced to the history of philosophy through mysterious letters from a mentor named Alberto Knox. Through engaging dialogues and thought-provoking questions, Sophie explores fundamental philosophical concepts, grapples with the mysteries of existence, and experiences a growing sense of self-awareness.",
            "genres": "Philosophical novel,young adult fiction,fantasy",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1343459906i/10959.jpg",
            "lang": "Norwegian",
            "publisher": "Aschehoug",
            "publishedDate": "December 5, 1991",
            "category": 4
        }
    },
    {
        "id" : 57,
        "bookInfo": {
            "title": "Zen and the Art of Motorcycle Maintenance",
            "author": "Robert M. Pirsig",
            "pages": 418,
            "description": "In Robert M. Pirsig's novel, a father and son embark on a motorcycle trip across America, providing a backdrop for philosophical reflections on life, values, and the pursuit of quality. The novel explores themes of rationality, craftsmanship, and the search for meaning through discussions of motorcycle maintenance and philosophical musings.",
            "genres": "Philosophical fiction,autobiographical novel",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1410136019i/629.jpg",
            "lang": "English",
            "publisher": "Farrar, Straus and Giroux",
            "publishedDate": "1974",
            "category": 4
        }
    },
    {
        "id" : 58,
        "bookInfo": {
            "title": "The Stranger",
            "author": "Albert Camus",
            "pages": 159,
            "description": "'The Stranger' by Albert Camus is a classic existentialist novel that explores the life of Meursault, an emotionally detached and indifferent Algerian. The story unfolds with Meursault's apathetic response to his mother's death, leading to his alienation from society. As he navigates through a series of events, including a senseless act of violence, the novel delves into themes of existentialism, absurdity, and the search for meaning in an indifferent world.",
            "genres": "Philosophical fiction,existentialism",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1590930002i/49552.jpg",
            "lang": "French",
            "publisher": "Gallimard",
            "publishedDate": "May 19, 1942",
            "category": 4
        }
    },
    {
        "id" : 59,
        "bookInfo": {
            "title": "Thus Spoke Zarathustra: A Book for All and None",
            "author": "Friedrich Nietzsche",
            "pages": 352 ,
            "description": "This is a work of philosophical fiction that presents the ideas of Nietzsche through the character of Zarathustra, a fictionalized version of the ancient Persian prophet Zoroaster. Zarathustra descends from his mountain retreat to proclaim the death of God and the rise of the Superman, the human embodiment of divinity. He also discusses concepts such as the will to power, the eternal recurrence, and the overman.",
            "genres": "Philosophy, Fiction, Classics",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1436774516i/25900222.jpg",
            "lang": "German",
            "publisher": "Ernst Schmeitzner",
            "publishedDate": "1883-1892",
            "category": 4
        }
    },
    {
        "id" : 60,
        "bookInfo": {
            "title": "The Tao of Pooh",
            "author": "Benjamin Hoff",
            "pages": 158,
            "description": "This is a book that introduces the philosophy of Taoism to Westerners by using the characters and stories of Winnie-the-Pooh. It shows how Pooh embodies the principles of wu wei (effortless doing) and pu (being open to experience), and how other characters like Owl, Rabbit, and Eeyore represent different aspects of human nature that hinder happiness.",
            "genres": "Philosophy, Nonfiction, Spirituality",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1348137748i/48757.jpg",
            "lang": "English",
            "publisher": "Dutton Books",
            "publishedDate": "1982",
            "category": 4
        }
    },
    {
        "id" : 61,
        "bookInfo": {
            "title": "Dracula",
            "author": "Bram stoker",
            "pages": 418,
            "description": "When Jonathan Harker visits Transylvania to help Count Dracula with the purchase of a London house, he makes a series of horrific discoveries about his client. Soon afterwards, various bizarre incidents unfold in England: an apparently unmanned ship is wrecked off the coast of Whitby; a young woman discovers strange puncture marks on her neck; and the inmate of a lunatic asylum raves about the 'Master' and his imminent arrival.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1387151694i/17245.jpg",
            "lang": "English",
            "publisher": "Archibald Constable and Company (UK)",
            "publishedDate": "May 26, 1897",
            "category": 5
        }
    },
    {
        "id" : 62,
        "bookInfo": {
            "title": "Frankenstein",
            "author": "Mary Shellby",
            "pages": 280,
            "description": "Victor Frankenstein tells Walton his story—a happy childhood, an unhealthy obsession with alchemy, and his engagement to his cousin Elizabeth. Victor enrolls at the University of Ingolstadt, where he discovers the secret of life and builds a creature from dead bodies .",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1631088473i/35031085.jpg",
            "lang": "English",
            "publisher": "Lackington, Hughes, Harding, Mavor & Jones",
            "publishedDate": "1 January 1818",
            "category": 5
        }
    },
    {
        "id" : 63,
        "bookInfo": {
            "title": "The Exorcist",
            "author": "William Peter Blatty",
            "pages": 340,
            "description": "'The Exorcist' is a gripping horror novel penned by William Peter Blatty. It tells the chilling tale of a young girl named Regan MacNeil, who becomes possessed by a demonic entity. As Regan's behavior grows increasingly disturbing and bizarre, her desperate mother seeks the help of two priests. The narrative follows their harrowing attempts to exorcise the demon from Regan. The novel's intense and unsettling themes led to its adaptation into a highly successful film.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1375168676i/179780.jpg",
            "lang": "English",
            "publisher": "Harper & Row",
            "publishedDate": "May 1, 1971",
            "category": 5
        }
    },
    {
        "id" : 64,
        "bookInfo": {
            "title": "Bird Box",
            "author": "Josh Malerman",
            "pages": 273,
            "description": "'Bird Box' is a thrilling post-apocalyptic novel written by Josh Malerman. Set in a world where mysterious creatures drive people to madness when they are seen, the story follows Malorie, a young woman who must navigate a treacherous journey blindfolded to protect herself and her children. The suspenseful narrative explores themes of survival, fear, and the lengths a person will go to protect their loved ones. It's a gripping and intense read that will keep you on the edge of your seat!",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1570393096i/44646576.jpg",
            "lang": "English",
            "publisher": "Harper Voyager (UK), Ecco (US)",
            "publishedDate": "March 27, 2014 (UK) May 31, 2014(US)",
            "category": 5
        }
    },
    {
        "id" : 65,
        "bookInfo": {
            "title": "The Haunting of Hill House",
            "author": "Shirley Jackson",
            "pages": 246,
            "description": "It is the story of four seekers who arrive at a notoriously unfriendly pile called Hill House: Dr. Montague, an occult scholar looking for solid evidence of a 'haunting'; Theodora, the lighthearted assistant; Eleanor, a friendless, fragile young woman well acquainted with poltergeists; and Luke, the future heir of Hill House. At first, their stay seems destined to be merely a spooky encounter with inexplicable phenomena. But Hill House is gathering its powers—and soon it will choose one of them to make its own.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327871336i/89717.jpg",
            "lang": "English",
            "publisher": "Viking",
            "publishedDate": "October 16, 1959",
            "category": 5
        }
    },
    {
        "id" : 66,
        "bookInfo": {
            "title": "The Shining",
            "author": "Stephen king",
            "pages": 447,
            "description": "Jack Torrance's new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he'll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote...and more sinister. And the only one to notice the strange and terrible forces gathering around the Overlook is Danny Torrance, a uniquely gifted five-year-old.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1353277730i/11588.jpg",
            "lang": "English",
            "publisher": "Doubleday",
            "publishedDate": "January 28,1997",
            "category": 5
        }
    },
    {
        "id" : 67,
        "bookInfo": {
            "title": "It",
            "author": "Stephen king",
            "pages": 1138,
            "description": "“It” is a horror novel written by Stephen King, first published in 1986. The story follows seven children who are terrorized by an evil entity that exploits the fears of its victims to disguise itself while hunting its prey. This entity primarily appears in the form of Pennywise the Dancing Clown to attract its preferred prey of young children. The novel explores themes such as the power of memory, childhood trauma, and the malevolence lurking beneath the idyllic façade of the American small town.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1334416842i/830502.jpg",
            "lang": "English",
            "publisher": "Viking",
            "publishedDate": "September 15, 1986",
            "category": 5
        }
    },
    {
        "id" : 68,
        "bookInfo": {
            "title": "The Girl Next Door",
            "author": "Jack Ketchum",
            "pages": 370,
            "description": "Suburbia. Shady, tree-lined streets, well-tended lawns and cozy homes. A nice, quiet place to grow up. Unless you are teenage Meg or her crippled sister, Susan. On a dead-end street, in the dark, damp basement of the Chandler house, Meg and Susan are left captive to the savage whims and rages of a distant aunt who is rapidly descending into madness. It is a madness that infects all three of her sons and finally the entire neighborhood. Only one troubled boy stands hesitantly between Meg and Susan and their cruel, torturous deaths. A boy with a very adult decision to make.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1298460378i/179735.jpg",
            "lang": "English",
            "publisher": "Warner Books, Overlook Connection Press, Leisure Books, Amazon Kindle",
            "publishedDate": "December 1, 1989",
            "category": 5
        }
    },
    {
        "id" : 69,
        "bookInfo": {
            "title": "The Amityville Horror",
            "author": "Jay Anson",
            "pages": 315,
            "description": "“The Amityville Horror” is a horror novel by American author Jay Anson, published in September 1977. The book is based on the alleged paranormal experiences of the Lutz family. The story begins when the Lutz family moves into their new home in Amityville, where Ronald DeFeo Jr. had murdered his family just a year earlier. However, after 28 days, the Lutzes flee the house, claiming to have been terrorized by paranormal phenomena. The book has sparked controversy and lawsuits over its truthfulness, and it has also been adapted into a series of films.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1306079371i/293101.jpg",
            "lang": "English",
            "publisher": "Prentice hall",
            "publishedDate": "September 13,1997",
            "category": 5
        }
    },
    {
        "id" : 70,
        "bookInfo": {
            "title": "The Woman in The Black",
            "author": "Susan Hill",
            "pages": 200,
            "description": "Set on the obligatory English moor, on an isolated causeway, the story has as its hero Arthur Kipps, an up-and-coming young solicitor who has come north from London to attend the funeral and settle the affairs of Mrs. Alice Drablow of Eel Marsh House. The routine formalities he anticipates give way to a tumble of events and secrets more sinister and terrifying than any nightmare: the rocking chair in the deserted nursery, the eerie sound of a pony and trap, a child's scream in the fog, and most dreadfully--and for Kipps most tragically--The Woman In Black.",
            "genres": "Horror",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327869942i/37034.jpg",
            "lang": "English",
            "publisher": "Hamish Hamilton",
            "publishedDate": "10 October 1983",
            "category": 5
        }
    },
    {
        "id" : 71,
        "bookInfo": {
            "title": "The 7 Habits of Highly Effective People",
            "author": "Stephen Covey, Jim Collins",
            "pages": 477,
            "description": "Stephen R. Covey's 'The 7 Habits of Highly Effective People' is a self-help book that outlines a framework for personal and professional success by focusing on character traits that lead to fulfillment. The book's core principles include being proactive, prioritizing tasks, seeking mutually beneficial solutions, and valuing the differences of others to achieve collective goals.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1421842784i/36072.jpg",
            "lang": "English",
            "publisher": "Free Press",
            "publishedDate": "1989",
            "category": 6
        }
    },
    {
        "id" : 72,
        "bookInfo": {
            "title": "Atomic Habits",
            "author": "James Clear",
            "pages": 319,
            "description": "Atomic Habits will reshape the way you think about progress and success, and give you the tools and strategies you need to transform your habits--whether you are a team looking to win a championship, an organization hoping to redefine an industry, or simply an individual who wishes to quit smoking, lose weight, reduce stress, or achieve any other goal.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1655988385i/40121378.jpg",
            "lang": "English",
            "publisher": "Penguin Random House",
            "publishedDate": "October 16, 2018",
            "category": 6
        }
    },
    {
        "id" : 73,
        "bookInfo": {
            "title": "How to Win Friends and Influence People",
            "author": "Dale Carnegie",
            "pages": 288,
            "description": "The book highlights human psychology and reveals to the reader the ways to connect with other auras of human existence and hence influence one another gradually. The success of a person definitely comes from wealth but a majority of it depends on how expressive a person is and how impressive he or she is. The book says that an impression is created only when a person makes others feel important or elevates them to a pedestal of significance. This is an art because at no point should the other person feel like you are manipulating him or her.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1442726934i/4865.jpg",
            "lang": "English",
            "publisher": "Simon & Schuster",
            "publishedDate": "October, 1936",
            "category": 6
        }
    },
    {
        "id" : 74,
        "bookInfo": {
            "title": "Mindset: The New Psychology of Success",
            "author": "Carol Dweck",
            "pages": 276,
            "description": "Dweck offers new insights into her now famous and broadly embraced concept. She introduces a phenomenon she calls false growth mindset and guides people toward adopting a deeper, truer growth mindset. She also expands the mindset concept beyond the individual, applying it to the cultures of groups and organizations. With the right mindset, you can motivate those you lead, teach, and love—to transform their lives and your own.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1436227012i/40745.jpg",
            "lang": "English",
            "publisher": "Random House Publishing Group",
            "publishedDate": "December 26, 2007",
            "category": 6
        }
    },
    {
        "id" : 75,
        "bookInfo": {
            "title": "You Are a Badass",
            "author": "Jen Sincero",
            "pages": 254,
            "description": "In this refreshingly entertaining how-to guide, #1 New York Times Bestselling Author and world-traveling success coach, Jen Sincero, serves up 27 bite-sized chapters full of hilariously inspiring stories, sage advice, easy exercises, and the occasional swear word. If you're ready to make some serious changes around here, You Are a Badass will help you: Identify and change the self-sabotaging beliefs and behaviors that stop you from getting what you want, blast past your fears so you can take big exciting risks, figure out how to make some damn money already, learn to love yourself and others, set big goals and reach them - it will basically show you how to create a life you totally love, and how to create it now.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1351539051i/15843166.jpg",
            "lang": "English",
            "publisher": "Running Press Adult",
            "publishedDate": "April 23, 2013",
            "category": 6
        }
    },
    {
        "id" : 76,
        "bookInfo": {
            "title": "The Power of Now: A Guide to Spiritual Enlightenment",
            "author": "Eckhart Tolle",
            "pages": 229,
            "description": "To make the journey into the Now we will need to leave our analytical mind and its false created self, the ego, behind. From the very first page of Eckhart Tolle's extraordinary book, we move rapidly into a significantly higher altitude where we breathe a lighter air. We become connected to the indestructible essence of our Being, “The eternal, ever present One Life beyond the myriad forms of life that are subject to birth and death.” Although the journey is challenging, Eckhart Tolle uses simple language and an easy question-and-answer format to guide us.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1689947880i/6708.jpg",
            "lang": "English",
            "publisher": "New World Library",
            "publishedDate": "August 19, 2004",
            "category": 6
        }
    },
    {
        "id" : 77,
        "bookInfo": {
            "title": "The Subtle Art of Not Giving a F*ck",
            "author": "Mark Manson",
            "pages": 212,
            "description": "There are only so many things we can give a f**k about so we need to figure out which ones really matter, Manson makes clear. While money is nice, caring about what you do with your life is better, because true wealth is about experience. A much-needed grab-you-by-the-shoulders-and-look-you-in-the-eye moment of real-talk, filled with entertaining stories and profane, ruthless humor, The Subtle Art of Not Giving a F**k is a refreshing slap for a generation to help them lead contented, grounded lives.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1465761302i/28257707.jpg",
            "lang": "English",
            "publisher": "HarperOne",
            "publishedDate": "September 13, 2016",
            "category": 6
        }
    },
    {
        "id" : 78,
        "bookInfo": {
            "title": "Daring Greatly: How the Courage to Be Vulnerable Transforms the Way We Live, Love, Parent, and Lead",
            "author": "Brené Brown",
            "pages": 287,
            "description": "In Daring Greatly, Dr. Brown challenges everything we think we know about vulnerability. Based on twelve years of research, she argues that vulnerability is not weakness, but rather our clearest path to courage, engagement, and meaningful connection. The book that Dr. Brown’s many fans have been waiting for, Daring Greatly will spark a new spirit of truth—and trust—in our organizations, families, schools, and communities.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1337110319i/13588356.jpg",
            "lang": "English",
            "publisher": "Gotham Books",
            "publishedDate": "2012",
            "category": 6
        }
    },
    {
        "id" : 79,
        "bookInfo": {
            "title": "The Four Agreements",
            "author": "Miguel Ruiz",
            "pages": 152,
            "description": "In The Four Agreements, don Miguel Ruiz reveals the source of self-limiting beliefs that rob us of joy and create needless suffering. Based on ancient Toltec wisdom, the Four Agreements offer a powerful code of conduct that can rapidly transform our lives to a new experience of freedom, true happiness, and love. The Four Agreements are: Be Impeccable With Your Word, Don't Take Anything Personally, Don't Make Assumptions, Always Do Your Best.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1630664059i/6596.jpg",
            "lang": "English",
            "publisher": "Amber-Allen Publishing",
            "publishedDate": "1997",
            "category": 6
        }
    },
    {
        "id" : 80,
        "bookInfo": {
            "title": "The Gifts of Imperfection",
            "author": "Brené Brown",
            "pages": 137,
            "description": "In this groundbreaking New York Times best seller, Dr. Brené Brown, a research professor and thought leader on vulnerability, courage, worthiness, and shame, shares ten guideposts on the power of Wholehearted living—a way of engaging with the world from a place of worthiness.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1369092544i/7015403.jpg",
            "lang": "English",
            "publisher": "Hazelden",
            "publishedDate": "2022",
            "category": 6
        }
    },
    {
        "id" : 81,
        "bookInfo": {
            "title": "Man's Search for Meaning",
            "author": "Viktor Frankl",
            "pages": 165,
            "description": "Psychiatrist Viktor Frankl's memoir has riveted generations of readers with its descriptions of life in Nazi death camps and its lessons for spiritual survival. Frankl argues that we cannot avoid suffering but we can choose how to cope with it, find meaning in it, and move forward with renewed purpose. At the heart of his theory, known as logotherapy, is a conviction that the primary human drive is not pleasure but the pursuit of what we find meaningful. Man's Search for Meaning has become one of the most influential books in America; it continues to inspire us all to find significance in the very act of living.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1535419394i/4069.jpg",
            "lang": "English",
            "publisher": "Verlag für Jugend und Volk (Austria) Beacon Press",
            "publishedDate": "1946",
            "category": 6
        }
    },
    {
        "id" : 82,
        "bookInfo": {
            "title": "The Art of Happiness",
            "author": "Dalai Lama XIV, Howard C. Cutler",
            "pages": 322,
            "description": "The Dalai Lama, a joyful figure, emphasizes happiness as life's purpose. Despite previous attempts, he collaborates with a psychiatrist to convey his wisdom effectively. Through conversations, stories, and meditations, the duo addresses daily challenges like anxiety and anger. The focus is on defeating obstacles and finding inner peace in aspects like relationships and the pursuit of wealth. The Dalai Lama advocates a deep, abiding source of joy to navigate life successfully.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1309287434i/38210.jpg",
            "lang": "English",
            "publisher": "Easton Press",
            "publishedDate": "1998",
            "category": 6
        }
    },
    {
        "id" : 83,
        "bookInfo": {
            "title": "Start with Why: How Great Leaders Inspire Everyone to Take Action",
            "author": "Simon Sinek",
            "pages": 256,
            "description": "Understanding the 'why' behind an organization is crucial. It goes beyond just explaining what and how, delving into the fundamental purpose. The 'why' isn't about money; it's the core reason for existence. Whether in big or small businesses, nonprofits, or politics, starting with 'why' is transformative. Leaders who start with 'why' inspire rather than manipulate, creating genuine loyalty. The essence lies in tapping into the deeper motivations that drive actions and decisions.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1360936414i/7108725.jpg",
            "lang": "English",
            "publisher": "Penguin Books Ltd",
            "publishedDate": "",
            "category": 6
        }
    },
    {
        "id" : 84,
        "bookInfo": {
            "title": "Grit: The Power of Passion and Perseverance",
            "author": "Angela Duckworth",
            "pages": 277,
            "description": "Angela Duckworth's compelling book, 'Grit', challenges the notion that talent alone guarantees success. Instead, she advocates for the power of focused persistence, which she terms 'grit'. Drawing on her research and personal experiences, Duckworth argues that identifying passions and following through on commitments are key determinants of achievement. Her journey, from teaching to neuroscience, led her to this hypothesis. Through her character lab at the University of Pennsylvania, Duckworth tested and validated her theory, exploring tough schools, West Point, and the National Spelling Bee. The book offers insights from history, modern experiments, and interviews with high achievers, emphasizing that grit, not genius, drives success.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1632024090i/27213329.jpg",
            "lang": "English",
            "publisher": "Simon & Schuster",
            "publishedDate": "3 May 2016",
            "category": 6
        }
    },
    {
        "id" : 85,
        "bookInfo": {
            "title": "The Miracle Morning: The Not-So-Obvious Secret Guaranteed to Transform Your Life: Before 8AM",
            "author": "Hal Elrod",
            "pages": 172,
            "description": "Getting everything you want out of life isn’t about doing more. It’s about becoming more. Hal Elrod and The Miracle Morning have helped millions of people become the person they need to be to create the life they’ve always wanted. Now, it’s your turn.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1459775078i/17166225.jpg",
            "lang": "English",
            "publisher": "Hal Elrod; 1st Paperback Edition",
            "publishedDate": "2012",
            "category": 6
        }
    },
    {
        "id" : 86,
        "bookInfo": {
            "title": "The Compound Effect: Jumpstart Your Income, Your Life, Your Success",
            "author": "Darren Hardy",
            "pages": 162,
            "description": "Darren Hardy, publisher of Success Magazine, presents The Compound Effect, a distillation of the fundamental principles that have guided the most phenomenal achievements in business, relationships, and beyond. This easy-to-use, step-by-step operating system allows you to multiply your success, chart your progress, and achieve any desire. If you’re serious about living an extraordinary life, use the power of The Compound Effect to create the success you want.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1337205071i/9420697.jpg",
            "lang": "English",
            "publisher": "Manjul Publishing House",
            "publishedDate": "2021",
            "category": 6
        }
    },
    {
        "id" : 87,
        "bookInfo": {
            "title": "The 5 Second Rule: Transform Your Life, Work, and Confidence with Everyday Courage",
            "author": "Mel Robbins",
            "pages": 263,
            "description": "The 5 Second Rule is the secret to changing anything about your life. You can use the Rule and its countdown method to break any bad habit, interrupt self-doubt and negative self-talk, and push yourself to take the actions that will change your life.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1486492516i/34189313.jpg",
            "lang": "English",
            "publisher": "Savio Republic",
            "publishedDate": "2017",
            "category": 6
        }
    },
    {
        "id" : 88,
        "bookInfo": {
            "title": "The Happiness Advantage",
            "author": "Shawn Achor",
            "pages": 272,
            "description": "In The Happiness Advantage, Shawn Achor, who spent over a decade living, researching, and lecturing at Harvard University, draws on his own research—including one of the largest studies of happiness and potential at Harvard and others at companies like UBS and KPMG—to fix this broken formula. Using stories and case studies from his work with thousands of Fortune 500 executives in 42 countries, Achor explains how we can reprogram our brains to become more positive in order to gain a competitive edge at work.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1381289860i/9484114.jpg",
            "lang": "English",
            "publisher": "Crown Publishing Group",
            "publishedDate": "2010",
            "category": 6
        }
    },
    {
        "id" : 89,
        "bookInfo": {
            "title": "The Life-Changing Magic of Tidying Up",
            "author": "Marie Kondō",
            "pages": 213,
            "description": "Marie Kondo's method transforms tidying up into a lasting solution, deviating from the common piecemeal approaches. Her KonMari Method, organized by categories, ensures a clutter-free home with enduring results. The focus on items that 'spark joy' revolutionizes decluttering, backed by Kondo's impressive track record—none of her clients have relapsed. This international bestseller provides detailed guidance for a tidy home, promising a calm and motivated mindset, making decluttering a one-time, transformative experience.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1418767178i/22318578.jpg",
            "lang": "English",
            "publisher": "Ten Speed Press",
            "publishedDate": "2014",
            "category": 6
        }
    },
    {
        "id" : 90,
        "bookInfo": {
            "title": "Make Your Bed",
            "author": "William H. McRaven",
            "pages": 125,
            "description": "If you want to change the world, start off by making your bed. On May 17, 2014, Admiral William H. McRaven addressed the graduating class of the University of Texas at Austin on their Commencement day. Taking inspiration from the university's slogan, 'What starts here changes the world,' he shared the ten principles he learned during Navy Seal training that helped him overcome challenges not only in his training and long Naval career, but also throughout his life; and he explained how anyone can use these basic lessons to change themselves-and the world-for the better.",
            "genres": "Self Help",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1495769497i/31423133.jpg",
            "lang": "English",
            "publisher": "Grand Central Publishing",
            "publishedDate": "April 4, 2017",
            "category": 6
        }
    },
    {
        "id" : 91,
        "bookInfo": {
            "title": "Leaves of Grass",
            "author": "Walt Whitman",
            "pages": 624,
            "description": "Walt Whitman's revolutionary poetry collection, 'Leaves of Grass,' celebrates the beauty of nature, the power of individualism, and the democratic ideals of America. Through free verse and unconventional imagery, Whitman expresses his profound love for humanity, embracing all aspects of life, from the mundane to the transcendent. He praises the physical body, the human spirit, and the interconnectedness of all living things.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1418012204i/27494.jpg",
            "lang": "English",
            "publisher": "Walt Whitman",
            "publishedDate": "July 4, 1855",
            "category": 7
        }
    },
    {
        "id" : 92,
        "bookInfo": {
            "title": "The Waste Land",
            "author": "T.S. Eliot, Michael North",
            "pages": 288,
            "description": "T.S. Eliot's 'The Waste Land' captures the disillusionment and fragmentation of post-World War I society through a series of vignettes and monologues, painting a desolate portrait of a world devoid of vitality and connection. The poem's central image, the wasteland, symbolizes the spiritual barrenness and moral decay that have engulfed society. Despite the bleakness, the final lines offer a glimmer of hope, suggesting the possibility of renewal and spiritual rebirth.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1597549396i/34080.jpg",
            "lang": "English",
            "publisher": "Ediciones Cátedra S.A.",
            "publishedDate": "December 28th 2005",
            "category": 7
        }
    },
    {
        "id" : 93,
        "bookInfo": {
            "title": "Milk and Honey",
            "author": "Rupi Kaur",
            "pages": 204,
            "description": "Milk and Honey is a collection of poetry and prose about survival. About the experience of violence, abuse, love, loss, and femininity.  It is split into four chapters, with each chapter dealing with a different pain. Healing a different heartache. Milk and Honey takes readers through a journey of the most bitter moments in life and finds sweetness in them -- because there is sweetness everywhere if you are just willing to look.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1491595510i/23513349.jpg",
            "lang": "English",
            "publisher": "Simon & Schuster",
            "publishedDate": "1 January 2015",
            "category": 7
        }
    },
    {
        "id" : 94,
        "bookInfo": {
            "title": "The Sun and Her Flowers",
            "author": "Rupi Kaur",
            "pages": 256,
            "description": "From Rupi Kaur, the #1 New York Times bestselling author of milk and honey, comes her long-awaited second collection of poetry. A vibrant and transcendent journey about growth and healing. Ancestry and honoring one’s roots. Expatriation and rising up to find a home within yourself. Divided into five chapters and illustrated by Kaur, the sun and her flowers is a journey of wilting, falling, rooting, rising, and blooming. A celebration of love in all its forms. this is the recipe of life said my mother as she held me in her arms as i wept think of those flowers you plant in the garden each year they will teach you that people too must wilt fall root rise in order to bloom.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1499791446i/35606560.jpg",
            "lang": "English",
            "publisher": "Andrews McMeel Publishing (US) Simon & Schuster (UK)",
            "publishedDate": "3 October 2017",
            "category": 7
        }
    },
    {
        "id" : 95,
        "bookInfo": {
            "title": "The Collected Poems of Emily Dickinson",
            "author": "Emily Dickinson",
            "pages": 400,
            "description": "Dickinson’s poetry is remarkable for its tightly controlled emotional and intellectual energy. The longest poem covers less than two pages. Yet in theme and tone her writing reaches for the sublime as it charts the landscape of the human soul. A true innovator, Dickinson experimented freely with conventional rhythm and meter, and often used dashes, off rhymes, and unusual metaphors—techniques that strongly influenced modern poetry. Dickinson’s idiosyncratic style, along with her deep resonance of thought and her observations about life and death, love and nature, and solitude and society, have firmly established her as one of America’s true poetic geniuses.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1411632009i/67522.jpg",
            "lang": "English",
            "publisher": "Gramercy",
            "publishedDate": "30 November 1988",
            "category": 7
        }
    },
    {
        "id" : 96,
        "bookInfo": {
            "title": "The Love Song of J. Alfred Prufrock and Other Poems",
            "author": "T.S. Eliot",
            "pages": 44,
            "description": "T.S. Eliot's 'The Love Song of J. Alfred Prufrock and Other Poems' delves into the inner turmoil of the modern individual, epitomized by the titular character, J. Alfred Prufrock. Caught in the throes of self-doubt and societal pressures, Prufrock grapples with his insecurities and hesitations, questioning his place in the world and his ability to connect with others. The collection explores themes of alienation, isolation, and the search for meaning in a fragmented and impersonal society",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1229242079i/118389.jpg",
            "lang": "English",
            "publisher": "Harriet Monroe chapbook",
            "publishedDate": "June 1915",
            "category": 7
        }
    },
    {
        "id" : 97,
        "bookInfo": {
            "title": "The Complete Poems",
            "author": "Anne Sexton",
            "pages": 622,
            "description": "From the joy and anguish of her own experience, Sexton fashioned poems that told truths about the inner lives of men and women. This book comprises Sexton's ten volumes of verse, including the Pulitzer Prize-winner Live or Die, as well as seven poems from her last years.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1425271044i/47730.jpg",
            "lang": "English",
            "publisher": "Ecco",
            "publishedDate": "28 April 1999",
            "category": 7
        }
    },
    {
        "id" : 98,
        "bookInfo": {
            "title": "The Essential Rumi",
            "author": "Rumi, Coleman Barks",
            "pages": 416,
            "description": "This revised and expanded edition of The Essential Rumi includes a new introduction by Coleman Barks and more than 80 never-before-published poems.  Through his lyrical translations, Coleman Barks has been instrumental in bringing this exquisite literature to a remarkably wide range of readers, making the ecstatic, spiritual poetry of thirteenth-century Sufi Mystic Rumi more popular than ever.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1391414844i/304079.jpg",
            "lang": "English",
            "publisher": "Harperone",
            "publishedDate": "1 January 2013",
            "category": 7
        }
    },
    {
        "id" : 99,
        "bookInfo": {
            "title": "Ariel",
            "author": "Sylvia Plath",
            "pages": 128,
            "description": "When Sylvia Plath died, she not only left behind a prolific life but also her unpublished literary masterpiece, Ariel. Her husband, Ted Hughes, brought the collection to life in 1966, and its publication garnered worldwide acclaim. This collection showcases the beloved poet’s brilliant, provoking, and always moving poems, including 'Ariel' and once again shows why readers have fallen in love with her work throughout the generations.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1442258738i/395090.jpg",
            "lang": "English",
            "publisher": "Harper & Row",
            "publishedDate": "1966",
            "category": 7
        }
    },
    {
        "id" : 100,
        "bookInfo": {
            "title": "The Collected Poems of W.B. Yeats",
            "author": "W.B. Yeats, Richard J. Finneran",
            "pages": 544,
            "description": "The Collected Poems of W. B. Yeats includes all of the poems authorized by Yeats for inclusion in his standard canon. Breathtaking in range, it encompasses the entire arc of his career, from luminous reworking of ancient Irish myths and legends, to passionate meditations on the demands and rewards of youth and old age, from exquisite, occasionally whimsical songs of love, nature, and art to somber and angry poems of life in a nation torn by war and uprising.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1436919797i/53022.jpg",
            "lang": "English",
            "publisher": "Simon & Schuster",
            "publishedDate": "9 September 1996",
            "category": 7
        }
    },
    {
        "id" : 101,
        "bookInfo": {
            "title": "The Prophet",
            "author": "Kahlil Gibran",
            "pages": 127,
            "description": "Kahlil Gibran's 'The Prophet' is a collection of poetic prose that delves into profound themes of love, friendship, freedom, and the human condition. Through the words of the titular prophet, Almustafa, Gibran offers timeless wisdom on navigating life's complexities, embracing the beauty of existence, and finding solace in the universal truths that connect us all.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1355046521i/2547.jpg",
            "lang": "English",
            "publisher": "Alfred A. Knopf",
            "publishedDate": "1923",
            "category": 7
        }
    },
    {
        "id" : 102,
        "bookInfo": {
            "title": "2Fish: A Poetry Book",
            "author": "Jhené Aiko Efuru Chilombo",
            "pages": 124,
            "description": "The Grammy-nominated singer/songwriter “transforms her pain into poetry” in this intimate collection (People).Jhené Aiko Efuru Chilombo has developed and refined a method of emoting through writing. 2Fish is a collection of intimate poems (and a few short stories) written by Chilombo from adolescence to adulthood, in no particular order. The book details Chilombo’s thoughts in their most raw and honest form—taken directly from a collection of notebooks she has kept since age twelve.“Poignant revealing poems.” —Vibe",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1510059365i/36551799.jpg",
            "lang": "English",
            "publisher": "Ulysses Press",
            "publishedDate": "December 19, 2017",
            "category": 7
        }
    },
    {
        "id" : 103,
        "bookInfo": {
            "title": "The Odyssey",
            "author": "Homer",
            "pages": 541,
            "description": "In the myths and legends that are retold here, Fagles has captured the energy and poetry of Homer's original in a bold, contemporary idiom, and given us an Odyssey to read aloud, to savor, and to treasure for its sheer lyrical mastery.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1390173285i/1381.jpg",
            "lang": "English",
            "publisher": "Penguin Classics",
            "publishedDate": "27 November 1997",
            "category": 7
        }
    },
    {
        "id" : 104,
        "bookInfo": {
            "title": "Beowulf",
            "author": "Seamus Heaney, William Morris, Chauncey Brewster Tinker, John Lesslie Hall",
            "pages": 245,
            "description": "Beowulf, a millennium-old narrative, follows the Scandinavian hero's exploits against the monstrous Grendel and a dragon. Nobel laureate Seamus Heaney, captivated by the poem's 'four-squareness of the utterance' and emotional depth, brings its epic qualities to life. The story transcends time, exploring the theme of confronting the monstrous, prevailing, and navigating the aftermath. Heaney's translation resonates with power, offering a fresh and convincing reality to the timeless tale for the modern reader.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327878125i/52357.jpg",
            "lang": "English",
            "publisher": "Farrar, Straus and Giroux",
            "publishedDate": "February 15, 2000",
            "category": 7
        }
    },
    {
        "id" : 105,
        "bookInfo": {
            "title": "Paradise Lost",
            "author": "John Milton",
            "pages": 453,
            "description": "John Milton's Paradise Lost is one of the greatest epic poems in the English language. It tells the story of the Fall of Man, a tale of immense drama and excitement, of rebellion and treachery, of innocence pitted against corruption, in which God and Satan fight a bitter battle for control of mankind's destiny. The struggle rages across three worlds - heaven, hell, and earth - as Satan and his band of rebel angels plot their revenge against God. At the center of the conflict are Adam and Eve, who are motivated by all too human temptations but whose ultimate downfall is unyielding love.",
            "genres": "Poetry",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1526070678i/15997.jpg",
            "lang": "English",
            "publisher": "Samuel Simmons",
            "publishedDate": "1667",
            "category": 7
        }
    },
    {
        "id" : 106,
        "bookInfo": {
            "title": "The Hunger Games",
            "author": "Suzanne Collins",
            "pages": 374,
            "description": "In Suzanne Collins's dystopian novel The Hunger Games, 16-year-old Katniss Everdeen volunteers to take her younger sister's place in the brutal annual Hunger Games, a televised event where two teenagers from each of the twelve districts fight to the death. With her survival skills and archery prowess, Katniss forms alliances and navigates the treacherous arena, ultimately challenging the Capitol's oppressive regime and becoming a symbol of rebellion for the oppressed districts.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1586722975i/2767052.jpg",
            "lang": "English",
            "publisher": "Scholastic",
            "publishedDate": "September 14, 2008 (Scholastic Press)",
            "category": 8
        }
    },
    {
        "id" : 107,
        "bookInfo": {
            "title": "The Fault in Our Stars",
            "author": "John Green",
            "pages": 313,
            "description": "Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel's story is about to be completely rewritten.Insightful, bold, irreverent, and raw, The Fault in Our Stars is award-winning author John Green's most ambitious and heartbreaking work yet, brilliantly exploring the funny, thrilling, and tragic business of being alive and in love.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1660273739i/11870085.jpg",
            "lang": "English",
            "publisher": "Penguin books",
            "publishedDate": "January 10, 2012 (Penguin Books)",
            "category": 8
        }
    },
    {
        "id" : 108,
        "bookInfo": {
            "title": "The Perks of Being a Wallflower",
            "author": "Stephen Chbosky",
            "pages": 256,
            "description": "This is the story of what it's like to grow up in high school. More intimate than a diary, Charlie's letters are singular and unique, hilarious and devastating. We may not know where he lives. We may not know to whom he is writing. All we know is the world he shares. Caught between trying to live his life and trying to run from it puts him on a strange course through uncharted territory. The world of first dates and mixed tapes, family dramas and new friends. The world of sex, drugs, and The Rocky Horror Picture Show, when all one requires is that the perfect song on that perfect drive to feel infinite.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1650033115i/22628.jpg",
            "lang": "English",
            "publisher": "Pocket Books (original cover) MTV Books (movie cover version)",
            "publishedDate": "February 1, 1999",
            "category": 8
        }
    },
    {
        "id" : 109,
        "bookInfo": {
            "title": "To Kill a Mockingbird",
            "author": "Harper Lee",
            "pages": 281,
            "description": "Compassionate, dramatic, and deeply moving, 'To Kill A Mockingbird' takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1553383690i/2657.jpg",
            "lang": "English",
            "publisher": "J.B. Lippincott & Co",
            "publishedDate": "July 11, 1960",
            "category": 8
        }
    },
    {
        "id" : 110,
        "bookInfo": {
            "title": "The Giver",
            "author": "Lois Lowry",
            "pages": 208,
            "description": "In Lois Lowry's poignant novel, The Giver, Jonas, an exceptional twelve-year-old boy in a seemingly harmonious society, is chosen for the extraordinary role of the Receiver. Under the guidance of the Giver, the sole keeper of memories from the world's past, Jonas embarks on a transformative journey that unveils the hidden truths behind his community's carefully constructed utopia.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1342493368i/3636.jpg",
            "lang": "English",
            "publisher": "Houghton Mifflin",
            "publishedDate": "April 26, 1993",
            "category": 8
        }
    },
    {
        "id" : 111,
        "bookInfo": {
            "title": "Divergent",
            "author": "Veronica Roth",
            "pages": 487,
            "description": "In Beatrice Prior's dystopian Chicago world, society is divided into five factions, each dedicated to the cultivation of a particular virtue—Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is—she can't have both. So she makes a choice that surprises everyone, including herself.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1618526890i/13335037.jpg",
            "lang": "English",
            "publisher": "Katherine Tegen Books",
            "publishedDate": "April 26, 2011",
            "category": 8
        }
    },
    {
        "id" : 112,
        "bookInfo": {
            "title": "The Book Theif",
            "author": "Markus Zusak",
            "pages": 584,
            "description": "It is 1939. Nazi Germany. The country is holding its breath. Death has never been busier, and will be busier still.By her brother's graveside, Liesel's life is changed when she picks up a single object, partially hidden in the snow. It is The Gravedigger's Handbook, left behind there by accident, and it is her first act of book thievery. So begins a love affair with books and words, as Liesel, with the help of her accordian-playing foster father, learns to read. Soon she is stealing books from Nazi book-burnings, the mayor's wife's library, wherever there are books to be found.But these are dangerous times. When Liesel's foster family hides a Jew in their basement, Liesel's world is both opened up, and closed down",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1696692135i/150698598.jpg",
            "lang": "English",
            "publisher": "Alfred A. Knopf",
            "publishedDate": "March 14, 2006 ",
            "category": 8
        }
    },
    {
        "id" : 113,
        "bookInfo": {
            "title": "The Outsiders",
            "author": "S.E. Hinton",
            "pages": 192,
            "description": "The Outsiders is about two weeks in the life of a 14-year-old boy. The novel tells the story of Ponyboy Curtis and his struggles with right and wrong in a society in which he believes that he is an outsider. According to Ponyboy, there are two kinds of people in the world: greasers and socs. A soc (short for 'social') has money, can get away with just about anything, and has an attitude longer than a limousine. A greaser, on the other hand, always lives on the outside and needs to watch his back. Ponyboy is a greaser, and he's always been proud of it, even willing to rumble against a gang of socs for the sake of his fellow greasers--until one terrible night when his friend Johnny kills a soc. The murder gets under Ponyboy's skin, causing his bifurcated world to crumble and teaching him that pain feels the same whether a soc or a greaser.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1442129426i/231804.jpg",
            "lang": "English",
            "publisher": "Viking press, Dell Publishing",
            "publishedDate": "April 24, 1967",
            "category": 8
        }
    },
    {
        "id" : 114,
        "bookInfo": {
            "title": "A Wrinkle in Time",
            "author": "Madeleine L’Engle",
            "pages": 218,
            "description": "In Madeleine L'Engle's A Wrinkle in Time, Meg Murry, her brother Charles Wallace, and their friend Calvin O'Keefe embark on a cosmic journey through the tesseract, a fifth dimension, to rescue Meg's missing father. Guided by the enigmatic Mrs. Whatsit, Mrs. Who, and Mrs. Which, they face the malevolent Black Thing on Camazotz, a planet ruled by conformity.",
            "genres": "Young adult",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1507963312i/33574273.jpg",
            "lang": "English",
            "publisher": "Ariel Books",
            "publishedDate": "January 1, 1962",
            "category": 8
        }
    },
    {
        "id" : 115,
        "bookInfo": {
            "title": "The Uglies",
            "author": "Scott Westerfeld",
            "pages": 436,
            "description": "Uglies is a 2005 science fiction novel by Scott Westerfeld. It is set in a future post scarcity dystopian world in which everyone is considered an 'ugly,' but then turned 'Pretty' by extreme cosmetic surgery when they reach the age of 16. It tells the story of teenager Tally Youngblood who rebels against society's enforced conformity, after her friends Shay and David show her the downsides to becoming a 'Pretty'.",
            "genres": "Young adult",
            "imgLink": "https://upload.wikimedia.org/wikipedia/en/f/fe/Uglies_book.jpg",
            "lang": "English",
            "publisher": "Simon Pulse",
            "publishedDate": "October 23, 2007",
            "category": 8
        }
    },
    {
        "id" : 116,
        "bookInfo": {
            "title": "Steve Jobs",
            "author": "Walter Isaacson",
            "pages": 656,
            "description": "This is a biography of Apple cofounder Steve Jobs, based on more than 40 interviews with him and 100 interviews with his family, friends, colleagues, and competitors. It covers his life, personality, and achievements in six industries: personal computers, animated movies, music, phones, tablet computing, and digital publishing.",
            "genres": ": Biography, Nonfiction, Business, Technology, History",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1511288482i/11084145.jpg",
            "lang": "English",
            "publisher": "Simon & Schuster",
            "publishedDate": "October 24, 2011",
            "category": 9
        }
    },
    {
        "id" : 117,
        "bookInfo": {
            "title": "The Diary of a Young Girl",
            "author": " Anne Frank",
            "pages": 300,
            "description": "Anne Frank's 'The Diary of a Young Girl' offers a poignant glimpse into the life of a Jewish teenager hiding from the Nazi occupation of the Netherlands. Confined to the Secret Annex with her family, Anne transforms her diary into a confidante, sharing her hopes, dreams, and fears as she navigates the challenges of adolescence amidst the constant threat of discovery. Her words paint a vivid portrait of resilience and hope, offering a testament to the enduring power of the human spirit.",
            "genres": "Autobiography, Historical Non-fiction, Diary",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1560816565i/48855.jpg",
            "lang": "Dutch",
            "publisher": "Doubleday",
            "publishedDate": "1947",
            "category": 9
        }
    },
    {
        "id" : 118,
        "bookInfo": {
            "title": "A World War II Story of Survival, Resilience, and Redemption",
            "author": "Laura Hillenbrand",
            "pages": 473,
            "description": "This is a biography of Louis Zamperini, a former Olympic runner who survived a plane crash, a raft ordeal, and a POW camp during World War II. It shows how he overcame physical and mental challenges with courage and faith.",
            "genres": "Biography, Nonfiction, History, War",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327861115i/8664353.jpg",
            "lang": "English",
            "publisher": "Random House",
            "publishedDate": "November 16, 2010",
            "category": 9
        }
    },
    {
        "id" : 119,
        "bookInfo": {
            "title": "The Autobiography of Malcolm X",
            "author": "Malcolm X with Alex Haley",
            "pages": 352,
            "description": "This is an autobiography of Malcolm X, a human rights activist and a leader of the Black Muslim movement. It is based on interviews he gave to Alex Haley, a journalist and writer, before his assassination in 1965. It covers his life, his conversion to Islam, his philosophy of black pride, black nationalism, and pan-Africanism, and his views on the racial issues in America and the world.",
            "genres": "Biography, Nonfiction, History, Politics",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1434682864i/92057.jpg",
            "lang": "English",
            "publisher": "Grove Press",
            "publishedDate": "October 29, 1965",
            "category": 9
        }
    },
    {
        "id" : 120,
        "bookInfo": {
            "title": "The Glass Castle",
            "author": "Jeannette Walls",
            "pages": 288,
            "description": "The Glass Castle is a memoir of resilience and redemption, and a revelatory look into a family at once deeply dysfunctional and uniquely vibrant. The book tells the story of Walls’ childhood, growing up in a nomadic family with an alcoholic father and a free-spirited mother.",
            "genres": "Nonfiction, Memoir, Biography, Book Club",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1523542886i/7445.jpg",
            "lang": "English",
            "publisher": "Scribner",
            "publishedDate": "March 2005",
            "category": 9
        }
    },
    {
        "id" : 121,
        "bookInfo": {
            "title": "Night",
            "author": "Elie Wiesel",
            "pages": 116,
            "description": "Elie Wiesel's 'Night' is a poignant memoir that chronicles his harrowing experiences as a Jewish teenager during the Holocaust. Stripped of his identity and humanity, Eliezer endures unspeakable horrors at Auschwitz, witnessing the systematic extermination of his people. Amidst the despair, Eliezer's love for his father becomes a beacon of hope, propelling him through the depths of suffering. Finally liberated, Eliezer emerges from the darkness forever changed, grappling with the loss of his family, his faith, and a world he once knew.",
            "genres": "Nonfiction, Science, History, Biography, Medicine",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1575073611i/1617.jpg",
            "lang": "English",
            "publisher": " Hill & Wang",
            "publishedDate": "1960",
            "category": 9
        }
    },
    {
        "id" : 122,
        "bookInfo": {
            "title": "The Immortal Life of Henrietta Lacks",
            "author": "Rebecca Skloot",
            "pages": 381,
            "description": "The book is a non-fiction account of the life and legacy of Henrietta Lacks, a poor African American woman whose cancer cells were taken without her consent and became the first immortal human cell line. The book explores the ethical, scientific, and personal implications of this discovery, as well as the history and experiences of Lacks’s family.",
            "genres": "Nonfiction, Science, History, Biography, Medicine",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327878144i/6493208.jpg",
            "lang": "English",
            "publisher": "Crown",
            "publishedDate": "February 2, 2010",
            "category": 9
        }
    },
    {
        "id" : 123,
        "bookInfo": {
            "title": "Angela’s Ashes",
            "author": "Frank McCourt",
            "pages": 368,
            "description": "Angela’s Ashes is a memoir of Frank McCourt’s childhood, growing up in poverty and hardship in Limerick, Ireland. The book recounts his struggles with his alcoholic father, his loving but overwhelmed mother, and his many siblings. The book also explores his loss of faith, his love of stories, and his determination to escape his miserable circumstances.",
            "genres": "Nonfiction, Memoir, Biography, Classics",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1348317139i/252577.jpg",
            "lang": "English",
            "publisher": "Scribner",
            "publishedDate": "September 5, 1996",
            "category": 9
        }
    },
    {
        "id" : 124,
        "bookInfo": {
            "title": "Born a Crime: Stories from a South African Childhood",
            "author": "Trevor Noah",
            "pages": 304,
            "description": "The book is an autobiographical comedy that narrates Noah’s experiences of growing up as a mixed-race child in apartheid South Africa. It explores his relationship with his rebellious mother, his encounters with racism and violence, and his journey to becoming a successful comedian and TV host.",
            "genres": "Nonfiction, Memoir, Biography, Humor, Autobiography",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1473867911i/29780253.jpg",
            "lang": "English",
            "publisher": "Spiegel & Grau",
            "publishedDate": "November 15, 2016",
            "category": 9
        }
    },
    {
        "id" : 125,
        "bookInfo": {
            "title": "Into the Wild",
            "author": "Jon Krakauer",
            "pages": 224,
            "description": "The book is a non-fiction biography that tells the story of Chris McCandless, a young man who left his comfortable life and ventured into the Alaskan wilderness in search of adventure and meaning. He died of starvation in an abandoned bus after four months of living off the land.",
            "genres": "Nonfiction, Biography, Adventure, Travel, Memoir, Nature",
            "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1634587789i/1845.jpg",
            "lang": "English",
            "publisher": "Villard",
            "publishedDate": "January 13, 1996",
            "category": 9
        }
    },
    {
        "id": 126,
        "bookInfo": {
          "title": "The Lies of Locke Lamora",
          "author": "Scott Lynch",
          "pages": 499,
          "description": "'The Lies of Locke Lamora' is a thrilling fantasy novel set in the city of Camorr, where a clever thief named Locke Lamora leads a band of skilled con artists. They navigate the dangerous underworld, pulling off elaborate heists and outsmarting their enemies. But when they attract the attention of a powerful and deadly figure known as the Gray King, their lives are put at risk. It's a tale of cunning, adventure, and betrayal.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1458646334i/29588376.jpg",
          "lang": "English",
          "publisher": "Gollancz",
          "publishedDate": "June 27, 2006",
          "category": 10
        }
      },
      {
        "id": 127,
        "bookInfo": {
          "title": "The Princess Bride",
          "author": "William Goldman",
          "pages": 398,
          "description": "'The Princess Bride' by William Goldman is a captivating tale of adventure, romance, and fantasy. The story revolves around a young woman named Buttercup, who resides in the country of Florin. She falls deeply in love with Westley, a farm boy working on her family's farm. When Westley leaves to seek his fortune and is reportedly killed by the Dread Pirate Roberts, Buttercup is left devastated. Her life takes another unexpected turn when she is chosen to be the bride of Prince Humperdinck, who needs to marry to ascend to the throne. However, before the wedding can take place, Buttercup is kidnapped by a trio of outlaws, setting the stage for a series of thrilling and humorous events. The novel is renowned for its unique blend of adventure, humor, and romance, making it a timeless classic.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327903636i/21787.jpg",
          "lang": "English",
          "publisher": "Ballantine Books",
          "publishedDate": "October 12, 1973",
          "category": 10
        }
      },
      {
        "id": 128,
        "bookInfo": {
          "title": "Stardust",
          "author": "Neil Gaiman",
          "pages": 288,
          "description": "'Stardust' is a novel by Neil Gaiman that blends historical and fantasy elements. The story is set in motion when Dunstan Thorn, who lives in the small English village of Wall, has a son named Tristran. Tristran promises his beloved, Victoria Forester, that he will retrieve a fallen star for her. This promise leads him to cross the wall into the magical land of Faerie. There, he discovers that the star is not a lump of celestial rock, but a beautiful woman named Yvaine. The novel follows Tristran's adventures in Faerie, which are filled with danger, sacrifice, and important lessons about love and transformation. Since its publication in 1999, 'Stardust' has been celebrated for its imaginative storytelling, winning the Mythopoeic Fantasy Award for Adult Literature.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1459127484i/16793.jpg",
          "lang": "English",
          "publisher": "HarperCollins",
          "publishedDate": "February 1, 1999",
          "category": 10
        }
      },
      {
        "id": 129,
        "bookInfo": {
          "title": "The Once and Future King",
          "author": "T.H. White",
          "pages": 639,
          "description": "'The Once and Future King' by T.H. White is a comprehensive tale that chronicles the life of King Arthur, from his childhood to his ascension to the throne and beyond. The story begins with Arthur, known as the Wart, living under the care of his foster father, Sir Ector. The Wart’s life takes a turn when he meets the magician Merlyn, who becomes his tutor. Merlyn imparts wisdom and knowledge to the Wart by transforming him into various animals, each teaching him different virtues. The turning point arrives when the Wart, unknowingly, pulls a sword from a stone, an act that signifies his destiny as the rightful king of England. The novel continues to explore Arthur's reign as king, his establishment of the Round Table, his complex relationship with Queen Guenever and Sir Lancelot, and the moral and philosophical dilemmas he faces as a ruler.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1388583899i/10571.jpg",
          "lang": "English",
          "publisher": "Collins",
          "publishedDate": "January 1, 1958",
          "category": 10
        }
      },
      {
        "id": 130,
        "bookInfo": {
          "title": "The Color of Magic",
          "author": "Terry Pratchett",
          "pages": 288,
          "description": "'The Color of Magic' is the first book in Terry Pratchett's beloved Discworld series. The story is set in a fantastical realm known as Discworld, a flat, round land in an alternate universe, carried through space on the back of a giant turtle. The main character is an incompetent and cynical wizard named Rincewind, who is hired as a guide to Twoflower, a naive tourist from the Agatean Empire. Twoflower's immense wealth, compared to the inhabitants of Ankh-Morpork, leads to him being kidnapped by a gang of thieves. Rincewind, alongside Twoflower's sentient Luggage, stages a rescue, leading to a series of adventures. The novel is a humorous epic adventure that plays with the vagaries of human nature, culture, literature, myth, and religion.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1407111017i/34497.jpg",
          "lang": "English",
          "publisher": "Corgi Books",
          "publishedDate": "December 1,1983",
          "category": 10
        }
      },
      {
        "id": 131,
        "bookInfo": {
          "title": "The Graveyard Book",
          "author": "Neil Gaiman",
          "pages": 312,
          "description": "'The Graveyard Book' by Neil Gaiman is a captivating tale of a boy named Nobody Owens, or 'Bod', who is raised by ghosts in a graveyard after his family is brutally murdered. The story begins when a man named Jack murders Bod’s family, but Bod, a toddler at the time, escapes and wanders into a graveyard. There, he is discovered by two ghosts, Mr. and Mrs. Owens, who decide to raise him. Bod’s guardian, a shadowy figure named Silas, protects him from the outside world, including Jack, who is still hunting for him. As Bod grows up among the supernatural occupants of the graveyard, he learns various ghostly abilities, including how to become invisible and haunt people’s dreams. The novel follows Bod’s adventures in the graveyard and his encounters with various creatures, both living and dead. It's a story of love, loss, and finding one's place in the world.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1531295292i/2213661.jpg",
          "lang": "English",
          "publisher": "HarperCollins",
          "publishedDate": "September 2008",
          "category": 10
        }
      },
      {
        "id": 132,
        "bookInfo": {
          "title": "A Game of Thrones",
          "author": "George R.R. Martin",
          "pages": 694,
          "description": "'A Game of Thrones' is the first book in the epic fantasy series 'A Song of Ice and Fire' by George R.R. Martin. The novel introduces readers to the complex and intriguing world of Westeros, where noble families vie for control of the Iron Throne. The story begins with King Robert Baratheon seeking the help of his old friend, Ned Stark, after the suspicious death of his right-hand man. Meanwhile, across the sea, the last surviving members of the deposed Targaryen dynasty are plotting to reclaim the throne. The book masterfully weaves together a tale of power, betrayal, and the supernatural, setting the stage for the rest of the series.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1336020650i/5061675.jpg",
          "lang": "English",
          "publisher": "Bantam Spectra",
          "publishedDate": "August 1, 1996",
          "category": 10
        }
      },
      {
        "id": 133,
        "bookInfo": {
          "title": "Harry Potter and the Sorcerer's Stone",
          "author": "J.K. Rowling",
          "pages": 309,
          "description": "“Harry Potter and the Sorcerer’s Stone” is the first book in J.K. Rowling’s renowned “Harry Potter” series. The story introduces us to Harry Potter, an orphaned boy who discovers on his eleventh birthday that he is a wizard. He is invited to attend Hogwarts School of Witchcraft and Wizardry, where he befriends Ron Weasley and Hermione Granger. Throughout the book, Harry learns about the magical world, his parents’ mysterious past, and the dark wizard who seeks to destroy him, Lord Voldemort.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1598823299i/42844155.jpg",
          "lang": "English",
          "publisher": "Bloomsbury Publishing",
          "publishedDate": "June 26, 1997",
          "category": 10
        }
      },
      {
        "id": 134,
        "bookInfo": {
          "title": "The Hobbit",
          "author": "J.R.R. Tolkien",
          "pages": 310,
          "description": "“The Hobbit” is a classic fantasy novel by J.R.R. Tolkien that takes place in the enchanting world of Middle-earth. The story follows the unassuming hobbit, Bilbo Baggins, who is thrust into an epic adventure by the wizard Gandalf and a company of thirteen dwarves led by Thorin Oakenshield. Their quest is to reclaim the dwarves’ homeland and treasure from the fearsome dragon, Smaug. Throughout his journey, Bilbo encounters various creatures, faces numerous challenges, and discovers a magical ring that has the power to render its wearer invisible.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1546071216i/5907.jpg",
          "lang": "English",
          "publisher": "George Allen & Unwin",
          "publishedDate": "September 21, 1937",
          "category": 10
        }
      },
      {
        "id": 135,
        "bookInfo": {
          "title": "Mistborn: The Final Empire",
          "author": "Brandon Sanderson",
          "pages": 541,
          "description": "“Mistborn: The Final Empire” is the first book in the “Mistborn” trilogy by Brandon Sanderson. The novel is set in a dystopian world known as Scadrial, where society is divided between the nobility and the oppressed class known as the skaa. The story follows a young street urchin named Vin, who discovers her Mistborn powers and joins a group of rebels led by Kelsier. Their goal is to overthrow the Final Empire and its tyrannical ruler, the Lord Ruler. The novel is renowned for its intricate plot, complex characters, and unique magic system.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1617768316i/68428.jpg",
          "lang": "English",
          "publisher": "Tor Books",
          "publishedDate": "July 17, 2006",
          "category": 10
        }
      },
      {
        "id": 136,
        "bookInfo": {
          "title": "The Blade Itself",
          "author": "Joe Abercrombie",
          "pages": 536,
          "description": "“The Blade Itself” is the first novel in “The First Law Trilogy” by Joe Abercrombie. The story is set in a world teetering on the brink of war, and follows several key characters. One of them is Logen Ninefingers, an infamous barbarian who has run out of luck and is on the verge of death. Another is Captain Jezal dan Luthar, a selfish nobleman who dreams of glory in the fencing circle. The third is Inquisitor Glokta, a former champion fencer who has become a torturer. Their lives are made more complicated by the arrival of Bayaz, a wizard who could either be the First of the Magi or a spectacular fraud.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1284167912l/944073.jpg",
          "lang": "English",
          "publisher": "Gollancz",
          "publishedDate": "May 4, 2006",
          "category": 10
        }
      },
      {
        "id": 137,
        "bookInfo": {
          "title": "The Name of the Wind",
          "author": "Patrick Rothfuss",
          "pages": 662,
          "description": "'The Name of the Wind' is an enchanting epic fantasy novel written by the incredibly talented Patrick Rothfuss. Set in a world where magic and music intertwine, the story revolves around the enigmatic and gifted musician, Kvothe. As we delve into Kvothe's life, we are transported into a realm filled with captivating adventures, intricate mysteries, and a burning desire for knowledge. With its richly detailed world-building, masterful storytelling, and a protagonist you can't help but root for, this book is a true gem for fans of fantasy. Get ready to lose yourself in the lyrical prose and immerse yourself in a tale that will leave you eagerly turning each page.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1270352123i/186074.jpg",
          "lang": "English",
          "publisher": "DAW Books",
          "publishedDate": "March 27, 2007",
          "category": 10
        }
      },
      {
        "id": 138,
        "bookInfo": {
          "title": "The Magicians",
          "author": "Lev Grossman",
          "pages": 402,
          "description": "“The Magicians” is a fantasy novel by Lev Grossman, first published in 2009. The story centers around Quentin Coldwater, a high school student from Brooklyn, New York, who is unhappy with his life despite his seemingly perfect circumstances. Quentin’s life takes a turn when he discovers and attends a secret college of magic in New York. The novel explores Quentin’s journey through the college, his discovery of magic, and the challenges he faces along the way. The book has been praised for its originality and has been adapted into a television series.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1694176583i/62698536.jpg",
          "lang": "English",
          "publisher": "Viking Press",
          "publishedDate": "August 11, 2009",
          "category": 10
        }
      },
      {
        "id": 139,
        "bookInfo": {
          "title": "Good omens",
          "author": "Terry Pratchett, Neil Gaiman",
          "pages": 448,
          "description": "Aziraphale, an angel, and Crowley, a demon, have been sent to Earth by their respective head offices with opposing missions: Aziraphale to encourage humanity, and Crowley to tempt them. However, over the millennia, they have grown fond of Earth and its inhabitants, and they have become close friends. When they learn that the son of Satan has been born and that Armageddon is imminent, they join forces to find the Antichrist and stop the apocalypse. Their quest takes them on a wild adventure that spans centuries and continents, and they must use all of their wit and cunning to prevent the end of the world.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1615552073i/12067.jpg",
          "lang": "English",
          "publisher": "HarperCollins Publishers",
          "publishedDate": "January 1, 1990",
          "category": 10
        }
      },
      {
        "id": 140,
        "bookInfo": {
          "title": "The Eye of the World",
          "author": "Robert Jordan",
          "pages": 814,
          "description": "In the world of Rand al'Thor, the Wheel of Time turns, and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. When the Dark One stirs and threatens to break free from his prison, the Dragon Reborn must rise to confront him. Rand al'Thor, a young farmboy from Emond's Field, is one of three ta'veren, or potential Dragons Reborn. He must leave behind his simple life and embark on a perilous journey to the Eye of the World, a place of immense power that holds the key to defeating the Dark One. Along the way, he is joined by a group of friends who will help him fulfill his destiny.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659905815i/228665.jpg",
          "lang": "English",
          "publisher": "Tor Books",
          "publishedDate": "January 15, 1990",
          "category": 10
        }
      },
      {
        "id": 141,
        "bookInfo": {
          "title": "The Last Unicorn",
          "author": "Peter S. Beagle",
          "pages": 296,
          "description": "In a magical forest, a unicorn learns that she may be the last of her kind. She sets out on a quest to find the other unicorns and discovers the true meaning of friendship, love, and loss along the way. Her journey takes her to the Red Bull, a creature of chaos and destruction, and to King Haggard, a lonely and despairing king who has captured the other unicorns. The Unicorn must find a way to save her friends and restore magic to the world before it is too late.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1524764327i/29127.jpg",
          "lang": "English",
          "publisher": "Viking Press",
          "publishedDate": "1968",
          "category": 10
        }
      },
      {
        "id": 142,
        "bookInfo": {
          "title": "Jonathan Strange & Mr Norrell",
          "author": "Susanna Clarke",
          "pages": 782,
          "description": "Set in 19th-century England during the Napoleonic Wars, Jonathan Strange & Mr Norrell is an alternative history novel that explores the resurgence of magic in a world where it has long been forgotten. The story revolves around two magicians, Gilbert Norrell and Jonathan Strange, who have very different approaches to their craft. Norrell is a reclusive and secretive magician, while Strange is more open-minded and adventurous. Their paths intertwine as they both seek to use magic to help England in its war against France. However, their rivalry and conflicting philosophies threaten to undermine their efforts and put the fate of the country at risk.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1357027589i/14201.jpg",
          "lang": "English",
          "publisher": "Bloomsbury Publishing",
          "publishedDate": "September 8, 2004",
          "category": 10
        }
      },
      {
        "id": 143,
        "bookInfo": {
          "title": "The Fellowship of the Ring",
          "author": "J.R.R. Tolkien",
          "pages": 472,
          "description": "In the peaceful Shire, a hobbit named Frodo Baggins inherits the One Ring, an artifact of immense power forged by the Dark Lord Sauron to dominate Middle-earth. Guided by the wise wizard Gandalf, Frodo embarks on a perilous quest to destroy the Ring in the fires of Mount Doom, the only place where it can be unmade. Along the way, he is joined by a fellowship of companions, including his loyal hobbit friends Sam, Merry, and Pippin, the valiant ranger Aragorn, the noble elf Legolas, the stout dwarf Gimli, and the cunning human Boromir. Together, they must face the dangers of the wilds, the pursuit of Sauron's evil forces, and the corrupting influence of the Ring itself, as they journey towards the dark land of Mordor to save Middle-earth from the shadow of Sauron.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1654215925i/61215351.jpg",
          "lang": "English",
          "publisher": "George Allen & Unwin",
          "publishedDate": "July 29, 1954",
          "category": 10
        }
      },
      {
        "id": 144,
        "bookInfo": {
          "title": "American Gods",
          "author": "Neil Gaiman",
          "pages": 465,
          "description": "Ex-convict Shadow Moon is released from prison only to find that his wife Laura has been killed in a car accident. He meets a mysterious man named Wednesday, who offers him a job as his bodyguard and driver. Shadow soon learns that Wednesday is an ancient god and that he is part of a larger conflict between the old gods and the new gods of America. The old gods, brought to America by immigrants, are losing their power as their worshippers forget them. The new gods, representing technology, media, and money, are becoming increasingly powerful. Shadow is caught in the middle of this conflict, and he must choose a side.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1462924585i/30165203.jpg",
          "lang": "English",
          "publisher": "William Morrow",
          "publishedDate": "June 19, 2001",
          "category": 10
        }
      },
      {
        "id": 145,
        "bookInfo": {
          "title": "The Way of Kings",
          "author": "Brandon Sanderson",
          "pages": 1008,
          "description": "On the storm-ravaged world of Roshar, where highstorms rule and the Knights Radiant have long vanished, three nations vie for control of the shattered Alethi kingdom. Dalinar Kholin, once a great general, struggles to find his place in a world without gods or kings. Shallan Davar, a young woman with a secret agenda, seeks knowledge and power among the scholars of Kharbranth. And Kaladin Stormblessed, a former slave, must decide whether to become a slave again or fight to free his people.",
          "genres": "Fantasy",
          "imgLink": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1659905828i/7235533.jpg",
          "lang": "English",
          "publisher": "Tor Books",
          "publishedDate": "August 31, 2010",
          "category": 10
        }
      }
    ]
